
<!DOCTYPE HTML>
<html lang="zh" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>设计模式原则 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../creator-mode/creator-mode.html" />
    
    
    <link rel="prev" href="dependency.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="輸入並搜尋" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="introduct.html">
            
                <a href="introduct.html">
            
                    
                    UML中类的关系
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="inherit.html">
            
                <a href="inherit.html">
            
                    
                    继承
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="realize.html">
            
                <a href="realize.html">
            
                    
                    实现
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="aggregation.html">
            
                <a href="aggregation.html">
            
                    
                    聚合关系
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="composition.html">
            
                <a href="composition.html">
            
                    
                    组合关系
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="association.html">
            
                <a href="association.html">
            
                    
                    关联关系
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.6" data-path="dependency.html">
            
                <a href="dependency.html">
            
                    
                    依赖关系
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter active" data-level="1.3" data-path="design-principle.html">
            
                <a href="design-principle.html">
            
                    
                    设计模式原则
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../creator-mode/creator-mode.html">
            
                <a href="../creator-mode/creator-mode.html">
            
                    
                    创建型模式
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../creator-mode/simple-factory/simple-factory.html">
            
                <a href="../creator-mode/simple-factory/simple-factory.html">
            
                    
                    简单工厂模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="../creator-mode/factory-method/factory-method.html">
            
                <a href="../creator-mode/factory-method/factory-method.html">
            
                    
                    工厂方法模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="../creator-mode/abstract-factory/abstract-factory.html">
            
                <a href="../creator-mode/abstract-factory/abstract-factory.html">
            
                    
                    抽象工厂模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.4" data-path="../creator-mode/factory-diff.html">
            
                <a href="../creator-mode/factory-diff.html">
            
                    
                    三种工厂模式比较
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.5" data-path="../creator-mode/builder/builder.html">
            
                <a href="../creator-mode/builder/builder.html">
            
                    
                    建造者模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.6" data-path="../creator-mode/prototype/prototype.html">
            
                <a href="../creator-mode/prototype/prototype.html">
            
                    
                    原型模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.7" data-path="../creator-mode/singleton/singleton.html">
            
                <a href="../creator-mode/singleton/singleton.html">
            
                    
                    单例模式
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="../structural-mode/structural.html">
            
                <a href="../structural-mode/structural.html">
            
                    
                    结构型模式
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="../structural-mode/proxy-static/proxy-static.html">
            
                <a href="../structural-mode/proxy-static/proxy-static.html">
            
                    
                    静态代理模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="../structural-mode/proxy-dynamic/proxy-dynamic.html">
            
                <a href="../structural-mode/proxy-dynamic/proxy-dynamic.html">
            
                    
                    动态代理模式
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="../behavioral-mode/behavioral.html">
            
                <a href="../behavioral-mode/behavioral.html">
            
                    
                    行为型模式
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本書使用 GitBook 釋出
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >设计模式原则</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x539F;&#x5219;">&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x539F;&#x5219;</h1>
<h2 id="&#x5199;&#x5728;&#x524D;&#x9762;">&#x5199;&#x5728;&#x524D;&#x9762;</h2>
<p>&#x5929;&#x4E0B;&#x6B66;&#x6797;&#xFF0C;&#x6797;&#x6797;&#x603B;&#x603B;&#x3002;&#x540D;&#x95E8;&#x6B63;&#x5B97;&#x5982;&#x5C11;&#x6797;&#x6B66;&#x5F53;&#xFF0C;&#x8BDA;&#x7136;&#x540D;&#x626C;&#x5929;&#x4E0B;&#xFF0C;&#x800C;&#x6B66;&#x6797;&#x4E4B;&#x5927;&#xFF0C;&#x4F46;&#x51E1;&#x4FEE;&#x5F97;&#x6697;&#x9556;&#x795E;&#x5251;&#x8005;&#xFF0C;&#x4EA6;&#x53EF;&#x72EC;&#x6B65;&#x6C5F;&#x6E56;&#x3002;&#x6240;&#x4EE5;&#x95E8;&#x6D3E;&#x65E0;&#x5C0A;&#x8D35;&#xFF0C;&#x53EA;&#x6709;&#x9002;&#x5408;&#x4E0D;&#x9002;&#x5408;&#x3002;&#x8BBE;&#x8BA1;&#x7684;&#x672C;&#x8D28;&#xFF1A;&#x5373;&#x4F7F;&#x6700;&#x61C2;&#x8BBE;&#x8BA1;&#x7684;&#x4EBA;&#xFF0C;&#x4E5F;&#x8981;&#x5FC3;&#x80F8;&#x5766;&#x8361;&#xFF0C;&#x8BA4;&#x8BC6;&#x5230;&#x81EA;&#x6211;&#x5C40;&#x9650;&#x6027;&#xFF0C;&#x4E0D;&#x53EF;&#x4EE5;&#x540D;&#x95E8;&#x6B63;&#x5B97;&#x81EA;&#x5C45;&#xFF0C;&#x987B;&#x8BA4;&#x8BC6;&#x5230;&#x83B7;&#x5F97;&#x771F;&#x7406;&#x662F;&#x4E00;&#x4E2A;&#x5B66;&#x65E0;&#x6B62;&#x5883;&#x3001;&#x6C38;&#x8FDC;&#x8FFD;&#x6C42;&#x7684;&#x8FC7;&#x7A0B;&#x3002;</p>
<p>&#x5341;&#x516B;&#x822C;&#x6B66;&#x827A;&#x6837;&#x6837;&#x7CBE;&#x901A;&#xFF0C;&#x4EC5;&#x51FA;&#x73B0;&#x5728;&#x6B66;&#x4FA0;&#x4F20;&#x8BF4;&#x4E2D;&#xFF0C; &#x73B0;&#x5B9E;&#x4E2D;&#x5373;&#x4F7F;&#x662F;&#x5168;&#x6808;&#x5DE5;&#x7A0B;&#x5E08;&#x4E5F;&#x4E0D;&#x6562;&#x8BF4;&#x5341;&#x516B;&#x822C;&#x6B66;&#x827A;&#x6837;&#x6837;&#x7CBE;&#x901A;&#xFF0C; &#x5BF9;&#x4E8E;&#x666E;&#x901A;&#x7684;IT&#x4ECE;&#x4E1A;&#x8005;&#x6765;&#x8BF4;&#xFF0C; &#x5982;&#x4F55;&#x4ECE;&#x7801;&#x519C;&#x53D8;&#x4E3A;&#x4E00;&#x4E2A;&#x5408;&#x683C;&#x7684;&#x5DE5;&#x7A0B;&#x5E08;&#x6765;&#x8BF4;&#xFF0C; &#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x662F;&#x5FC5;&#x7ECF;&#x4E4B;&#x8DEF;&#x3002; &#x5F53;&#x7136;&#x8981;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x4E00;&#x5B9A;&#x8981;&#x9075;&#x5FAA;&#x8BBE;&#x8BA1;&#x7684;&#x516D;&#x5927;&#x539F;&#x5219;&#x3002;&#x5728;&#x5DE5;&#x4F5C;&#x7684;&#x521D;&#x671F;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x4F1A;&#x7ECF;&#x5E38;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x611F;&#x53D7;&#xFF0C;&#x81EA;&#x5DF1;&#x7684;&#x4EE3;&#x7801;&#x63A5;&#x53E3;&#x8BBE;&#x8BA1;&#x6DF7;&#x4E71;&#x3001;&#x4EE3;&#x7801;&#x8026;&#x5408;&#x8F83;&#x4E3A;&#x4E25;&#x91CD;&#x3001;&#x4E00;&#x4E2A;&#x7C7B;&#x7684;&#x4EE3;&#x7801;&#x8FC7;&#x591A;&#x7B49;&#x7B49;&#xFF0C;&#x5F53;&#x81EA;&#x5DF1;&#x56DE;&#x5934;&#x518D;&#x770B;&#x8FD9;&#x4E9B;&#x4EE3;&#x7801;&#x65F6;&#x53EF;&#x80FD;&#x4F1A;&#x611F;&#x6168;&#xFF0C;&#x600E;&#x4E48;&#x80FD;&#x5199;&#x6210;&#x8FD9;&#x4E2A;&#x9E1F;&#x6837;&#x3002;&#x518D;&#x770B;&#x90A3;&#x4E9B;&#x77E5;&#x540D;&#x7684;&#x5F00;&#x6E90;&#x5E93;&#xFF0C;&#x5B83;&#x4EEC;&#x5927;&#x591A;&#x6709;&#x6574;&#x6D01;&#x7684;&#x4EE3;&#x7801;&#x3001;&#x6E05;&#x6670;&#x7B80;&#x5355;&#x7684;&#x63A5;&#x53E3;&#x3001;&#x804C;&#x8D23;&#x5355;&#x4E00;&#x7684;&#x7C7B;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x4F1A;&#x901A;&#x5E38;&#x4F1A;&#x6376;&#x80F8;&#x987F;&#x8DB3;&#x800C;&#x611F;&#x6168;&#xFF1A;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x8001;&#x592B;&#x624D;&#x80FD;&#x5199;&#x51FA;&#x8FD9;&#x6837;&#x7684;&#x4EE3;&#x7801;&#xFF01;</p>
<p>&#x5728;&#x505A;&#x5F00;&#x53D1;&#x7684;&#x8FD9;&#x4E9B;&#x5E74;&#x4E2D;&#xFF0C;&#x6211;&#x6E10;&#x6E10;&#x7684;&#x611F;&#x89C9;&#x5230;&#xFF0C;&#x5176;&#x5B9E;&#x56FD;&#x5185;&#x7684;&#x4E00;&#x4E9B;&#x521D;&#x3001;&#x4E2D;&#x7EA7;&#x5DE5;&#x7A0B;&#x5E08;&#x5199;&#x7684;&#x4E1C;&#x897F;&#x4E0D;&#x89C4;&#x8303;&#x6216;&#x8005;&#x8BF4;&#x4E0D;&#x591F;&#x6E05;&#x6670;&#x7684;&#x539F;&#x56E0;&#x662F;&#x7F3A;&#x4E4F;&#x4E00;&#x4E9B;&#x6307;&#x5BFC;&#x89C4;&#x5219;&#x3002;&#x4ED6;&#x4EEC;&#x624B;&#x4E2D;&#x6325;&#x821E;&#x7740;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x5927;&#x65D7;&#xFF0C;&#x5199;&#x51FA;&#x6765;&#x7684;&#x4E1C;&#x897F;&#x5374;&#x5145;&#x65A5;&#x7740;&#x9762;&#x5411;&#x8FC7;&#x7A0B;&#x7684;&#x6C14;&#x5473;&#x3002;&#x4E5F;&#x8BB8;&#x662F;&#x4ED6;&#x4EEC;&#x4E0D;&#x77E5;&#x9053;&#x6709;&#x8FD9;&#x4E9B;&#x89C4;&#x5219;&#xFF0C;&#x4E5F;&#x8BB8;&#x662F;&#x4ED6;&#x4EEC;&#x77E5;&#x9053;&#x4F46;&#x662F;&#x4E0D;&#x80FD;&#x5F88;&#x597D;&#x7684;&#x8FD0;&#x7528;&#x5230;&#x5B9E;&#x9645;&#x7684;&#x4EE3;&#x7801;&#x4E2D;&#xFF0C;&#x4EA6;&#x6216;&#x662F;&#x4ED6;&#x4EEC;&#x6CA1;&#x6709;&#x5728;&#x5B9E;&#x6218;&#x9879;&#x76EE;&#x4E2D;&#x4F53;&#x4F1A;&#x5230;&#x8FD9;&#x4E9B;&#x539F;&#x5219;&#x80FD;&#x591F;&#x5E26;&#x6765;&#x7684;&#x4F18;&#x70B9;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x4ED6;&#x4EEC;&#x5BF9;&#x8FD9;&#x4E9B;&#x539F;&#x5219;&#x5E76;&#x6CA1;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x91CD;&#x89C6;&#x3002;</p>
<h2 id="&#x8BBE;&#x8BA1;&#x7684;&#x516D;&#x5927;&#x539F;&#x5219;">&#x8BBE;&#x8BA1;&#x7684;&#x516D;&#x5927;&#x539F;&#x5219;</h2>
<p>&#x5728;&#x6B64;&#x4E4B;&#x524D;&#xFF0C;&#x6709;&#x4E00;&#x70B9;&#x9700;&#x8981;&#x5927;&#x5BB6;&#x77E5;&#x9053;&#xFF0C;&#x719F;&#x6089;&#x8FD9;&#x4E9B;&#x539F;&#x5219;&#x5E76;&#x4E0D;&#x662F;&#x8BF4;&#x4F60;&#x5199;&#x51FA;&#x7684;&#x7A0B;&#x5E8F;&#x5C31;&#x4E00;&#x5B9A;&#x7075;&#x6D3B;&#x3001;&#x6E05;&#x6670;&#xFF0C;&#x53EA;&#x662F;&#x4E3A;&#x4F60;&#x4F18;&#x79C0;&#x7684;&#x4EE3;&#x7801;&#x4E4B;&#x8DEF;&#x94FA;&#x4E0A;&#x4E86;&#x4E00;&#x5C42;&#x6805;&#x680F;&#xFF0C;&#x5728;&#x8FD9;&#x4E9B;&#x539F;&#x5219;&#x7684;&#x6307;&#x5BFC;&#x4E0B;&#xFF0C;&#x4F60;&#x624D;&#x80FD;&#x907F;&#x514D;&#x9677;&#x5165;&#x4E00;&#x4E9B;&#x5E38;&#x89C1;&#x7684;&#x4EE3;&#x7801;&#x6CE5;&#x6CBC;&#xFF0C;&#x4ECE;&#x800C;&#x8BA9;&#x4F60;&#x5199;&#x51FA;&#x4F18;&#x79C0;&#x7684;&#x4E1C;&#x897F;&#x3002;</p>
<h3 id="&#x5355;&#x4E00;&#x539F;&#x5219;single-responsibility-principle">&#x5355;&#x4E00;&#x539F;&#x5219;(Single Responsibility Principle)</h3>
<p>&#x5355;&#x4E00;&#x804C;&#x8D23;&#x539F;&#x5219;&#x7684;&#x82F1;&#x6587;&#x540D;&#x79F0;&#x662F; Single Responsibility Principle&#xFF0C;&#x7B80;&#x79F0;&#x662F; SPR&#xFF0C;&#x7B80;&#x5355;&#x5730;&#x8BF4;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x7C7B;&#x53EA;&#x505A;&#x4E00;&#x4EF6;&#x4E8B;&#xFF0C;&#x8FD9;&#x4E2A;&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#x5907;&#x53D7;&#x4E89;&#x8BAE;&#x5374;&#x53C8;&#x6781;&#x5176;&#x91CD;&#x8981;&#x3002;&#x53EA;&#x8981;&#x4F60;&#x60F3;&#x548C;&#x522B;&#x4EBA;&#x4E89;&#x6267;&#x3001;&#x6004;&#x6C14;&#x6216;&#x8005;&#x662F;&#x5435;&#x67B6;&#xFF0C;&#x8FD9;&#x4E2A;&#x539F;&#x5219;&#x662F;&#x5C61;&#x8BD5;&#x4E0D;&#x723D;&#x7684;&#x3002;&#x56E0;&#x4E3A;&#x5355;&#x4E00;&#x804C;&#x8D23;&#x7684;&#x5212;&#x5206;&#x754C;&#x9650;&#x5E76;&#x4E0D;&#x662F;&#x5982;&#x9A6C;&#x8DEF;&#x4E0A;&#x7684;&#x884C;&#x8F66;&#x9053;&#x90A3;&#x4E48;&#x6E05;&#x6670;&#xFF0C;&#x5F88;&#x591A;&#x65F6;&#x5019;&#x90FD;&#x662F;&#x9700;&#x8981;&#x4E2A;&#x4EBA;&#x7ECF;&#x9A8C;&#x6765;&#x754C;&#x5B9A;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x6700;&#x5927;&#x7684;&#x95EE;&#x9898;&#x5C31;&#x662F;&#x5BF9;&#x804C;&#x8D23;&#x7684;&#x5B9A;&#x4E49;&#xFF0C;&#x4EC0;&#x4E48;&#x662F;&#x7C7B;&#x7684;&#x804C;&#x8D23;&#xFF0C;&#x4EE5;&#x53CA;&#x600E;&#x4E48;&#x5212;&#x5206;&#x7C7B;&#x7684;&#x804C;&#x8D23;&#x3002;&#x8FD9;&#x8DDF;&#x6211;&#x4EEC;&#x793E;&#x4F1A;&#x5206;&#x5DE5;&#x4E00;&#x6837;&#xFF0C; &#x4E00;&#x4E9B;&#x4EBA;&#x5E72;&#x8FD9;&#x4E2A;&#xFF0C; &#x53E6;&#x4E00;&#x4E9B;&#x4EBA;&#x5E72;&#x90A3;&#x4E2A;&#xFF0C;&#x53EA;&#x6709;&#x5927;&#x5BB6;&#x90FD;&#x8FD9;&#x6837;&#x505A;&#x4E86;&#xFF0C; &#x6211;&#x4EEC;&#x7684;&#x793E;&#x4F1A;&#x624D;&#x66F4;&#x548C;&#x8C10;&#x3002;</p>
<p>&#x8BD5;&#x60F3;&#x4E00;&#x4E0B;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x9075;&#x5B88;&#x4E86;&#x8FD9;&#x4E2A;&#x539F;&#x5219;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x7684;&#x7C7B;&#x5C31;&#x4F1A;&#x5212;&#x5206;&#x7684;&#x5F88;&#x7EC6;&#xFF0C;&#x6BCF;&#x4E2A;&#x7C7B;&#x90FD;&#x6709;&#x6BD4;&#x8F83;&#x5355;&#x4E00;&#x7684;&#x804C;&#x8D23;&#xFF0C;&#x8FD9;&#x4E0D;&#x5C31;&#x662F;&#x9AD8;&#x5185;&#x805A;&#x3001;&#x4F4E;&#x8026;&#x5408;&#x4E48;&#xFF01;&#x5F53;&#x7136;&#xFF0C;&#x5982;&#x4F55;&#x754C;&#x5B9A;&#x7C7B;&#x7684;&#x804C;&#x8D23;&#x5C31;&#x9700;&#x8981;&#x4F60;&#x7684;&#x4E2A;&#x4EBA;&#x7ECF;&#x9A8C;&#x4E86;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x771F;&#x6B63;&#x8981;&#x505A;&#x7684;&#x8BB8;&#x591A;&#x5185;&#x5BB9;&#xFF0C;&#x5C31;&#x662F;&#x53D1;&#x73B0;&#x804C;&#x8D23;&#x5E76;&#x628A;&#x90A3;&#x4E9B;&#x804C;&#x8D23;&#x76F8;&#x4E92;&#x5206;&#x79BB;&#xFF0C;&#x5C31;&#x662F;&#x62BD;&#x8C61;&#x7684;&#x80FD;&#x529B;&#x3002;&#x5176;&#x5B9E;&#x8981;&#x53BB;&#x5224;&#x65AD;&#x662F;&#x5426;&#x5E94;&#x8BE5;&#x5206;&#x79BB;&#x51FA;&#x7C7B;&#x6765;&#xFF0C;&#x4E5F;&#x4E0D;&#x96BE;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x5982;&#x679C;&#x4F60;&#x80FD;&#x60F3;&#x5230;&#x591A;&#x4E8E;&#x4E00;&#x4E2A;&#x7684;&#x52A8;&#x673A;&#x53BB;&#x6539;&#x53D8;&#x4E00;&#x4E2A;&#x7C7B;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x7C7B;&#x5C31;&#x5177;&#x6709;&#x591A;&#x4E8E;&#x4E00;&#x4E2A;&#x7684;&#x804C;&#x8D23;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x6765;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x7F51;&#x7EDC;&#x7C7B;&#xFF0C;&#x4EE3;&#x7801;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code class="lang-java"><span class="hljs-keyword">public</span> <span class="hljs-class"><span class="hljs-keyword">interface</span> <span class="hljs-title">IHttp</span> </span>{
    <span class="hljs-comment">/**
     * &#x53D1;&#x9001; Http &#x8BF7;&#x6C42;&#xFF0C;&#x5E76;&#x4E14;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A; Response
     */</span>
    <span class="hljs-function"><span class="hljs-keyword">public</span> Response <span class="hljs-title">sendRequest</span><span class="hljs-params">(Request&lt;?&gt; request)</span></span>;
}
</code></pre>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;IHttp &#x53EA;&#x6709;&#x4E00;&#x4E2A; sendRequest &#x51FD;&#x6570;&#xFF0C;&#x5B83;&#x7684;&#x804C;&#x8D23;&#x5C31;&#x662F;&#x6267;&#x884C;&#x7F51;&#x7EDC;&#x8BF7;&#x6C42;&#x5E76;&#x4E14;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A; Response&#xFF0C;&#x5B83;&#x7684;&#x804C;&#x8D23;&#x5F88;&#x5355;&#x4E00;&#xFF0C;&#x8FD9;&#x6837;&#x5728;&#x9700;&#x8981;&#x4FEE;&#x6539;&#x6267;&#x884C;&#x7F51;&#x7EDC;&#x8BF7;&#x6C42;&#x7684;&#x76F8;&#x5173;&#x4EE3;&#x7801;&#x65F6;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x4FEE;&#x6539;&#x5B9E;&#x73B0; Http &#x63A5;&#x53E3;&#x7684;&#x7C7B;&#xFF0C;&#x800C;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x5176;&#x4ED6;&#x7C7B;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x5982;&#x679C;&#x67D0;&#x4E2A;&#x7C7B;&#x7684;&#x804C;&#x8D23;&#x5305;&#x542B;&#x6709;&#x6267;&#x884C;&#x7F51;&#x7EDC;&#x8BF7;&#x6C42;&#x3001;&#x89E3;&#x6790;&#x7F51;&#x7EDC;&#x8BF7;&#x6C42;&#x3001;&#x8FDB;&#x884C; gzip &#x538B;&#x7F29;&#x3001;&#x5C01;&#x88C5;&#x8BF7;&#x6C42;&#x53C2;&#x6570;&#x7B49;&#xFF0C;&#x90A3;&#x4E48;&#x5728;&#x4F60;&#x4FEE;&#x6539;&#x67D0;&#x5904;&#x4EE3;&#x7801;&#x65F6;&#x5C31;&#x5FC5;&#x987B;&#x8C28;&#x614E;&#xFF0C;&#x4EE5;&#x514D;&#x4FEE;&#x6539;&#x7684;&#x4EE3;&#x7801;&#x5F71;&#x54CD;&#x4E86;&#x5176;&#x5B83;&#x7684;&#x529F;&#x80FD;&#x3002;&#x5F53;&#x4F60;&#x4FEE;&#x6539;&#x7684;&#x4EE3;&#x7801;&#x80FD;&#x591F;&#x57FA;&#x672C;&#x4E0A;&#x4E0D;&#x5F71;&#x54CD;&#x5176;&#x4ED6;&#x529F;&#x80FD;&#x3002;&#x8FD9;&#x5C31;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x4FDD;&#x8BC1;&#x4E86;&#x4EE3;&#x7801;&#x7684;&#x53EF;&#x7EF4;&#x62A4;&#x6027;&#x3002;&#x6CE8;&#x610F;&#xFF0C;&#x5355;&#x4E00;&#x804C;&#x8D23;&#x539F;&#x5219;&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x7C7B;&#x53EA;&#x80FD;&#x6709;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x800C;&#x662F;&#x8BF4;&#x8FD9;&#x4E2A;&#x7C7B;&#x4E2D;&#x7684;&#x51FD;&#x6570;&#x6240;&#x505A;&#x7684;&#x5DE5;&#x4F5C;&#x662F;&#x9AD8;&#x5EA6;&#x76F8;&#x5173;&#x7684;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x9AD8;&#x5185;&#x805A;&#x3002;</p>
<p>&#x57FA;&#x672C;&#x5224;&#x65AD;&#x539F;&#x5219;&#xFF0C; &#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x7C7B;&#xFF0C;&#x5F53;&#x786E;&#x8BA4;&#x4EE5;&#x540E;&#xFF0C; &#x5B83;&#x7684;&#x8D23;&#x4EFB;&#x5C31;&#x786E;&#x5B9A;&#x4E86;&#xFF0C;&#x4E0D;&#x80FD;&#x589E;&#x52A0;&#x5B83;&#x884C;&#x4E3A;&#x4EE5;&#x5916;&#x7684;&#x529F;&#x80FD;&#x3002; &#x4F8B;&#x5982;&#x4E00;&#x822C;&#x6211;&#x4EEC;&#x5B9A;&#x4E49; API &#x63A5;&#x53E3;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x4E2A;&#x63A5;&#x53E3;&#x5E72;&#x4E86;&#x5F88;&#x591A;&#x4E8B;&#x60C5;&#xFF0C; &#x5C31;&#x662F;&#x4E00;&#x4E9B;&#x9690;&#x542B;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x8BA4;&#x4E3A;&#x5B83;&#x8BBE;&#x8BA1;&#x6CA1;&#x6709;&#x9075;&#x5FAA;<strong>&#x5355;&#x4E00;&#x539F;&#x5219;</strong>&#x3002;
<strong>&#x4F18;&#x70B9;</strong></p>
<ul>
<li>&#x7C7B;&#x7684;&#x590D;&#x6742;&#x6027;&#x964D;&#x4F4E;&#xFF0C;&#x5B9E;&#x73B0;&#x4EC0;&#x4E48;&#x804C;&#x8D23;&#x90FD;&#x6709;&#x6E05;&#x6670;&#x660E;&#x786E;&#x7684;&#x5B9A;&#x4E49;&#x3002;</li>
<li>&#x53EF;&#x8BFB;&#x6027;&#x63D0;&#x9AD8;&#xFF0C;&#x590D;&#x6742;&#x6027;&#x964D;&#x4F4E;&#xFF0C;&#x90A3;&#x5F53;&#x7136;&#x53EF;&#x8BFB;&#x6027;&#x63D0;&#x9AD8;&#x4E86;&#x3002;</li>
<li>&#x53EF;&#x7EF4;&#x62A4;&#x6027;&#x63D0;&#x9AD8;&#xFF0C;&#x53EF;&#x8BFB;&#x6027;&#x63D0;&#x9AD8;&#x4E86;&#xFF0C;&#x90A3;&#x5F53;&#x7136;&#x66F4;&#x5BB9;&#x6613;&#x7EF4;&#x62A4;&#x4E86;&#x3002;</li>
<li>&#x53D8;&#x66F4;&#x5F15;&#x8D77;&#x7684;&#x98CE;&#x9669;&#x964D;&#x4F4E;&#xFF0C;&#x53D8;&#x66F4;&#x662F;&#x5FC5;&#x4E0D;&#x53EF;&#x5C11;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x63A5;&#x53E3;&#x7684;&#x5355;&#x4E00;&#x804C;&#x8D23;&#x505A;&#x5F97;&#x597D;&#xFF0C;&#x4E00;&#x4E2A;&#x63A5;&#x53E3;&#x4FEE;&#x6539;&#x53EA;&#x5BF9;&#x5E94;&#x7684;&#x5B9E;&#x73B0;&#x7C7B;&#x6709;&#x5F71;&#x54CD;&#xFF0C;&#x5BF9;&#x5176;&#x4ED6;&#x7684;&#x63A5;&#x53E3;&#x65E0;&#x5F71;&#x54CD;&#xFF0C;&#x8FD9;&#x5BF9;&#x7CFB;&#x7EDF;&#x7684;&#x6269;&#x5C55;&#x6027;&#x3001;&#x7EF4;&#x62A4;&#x6027;&#x90FD;&#x6709;&#x975E;&#x5E38;&#x5927;&#x7684;&#x5E2E;&#x52A9;&#x3002;</li>
</ul>
<h3 id="&#x91CC;&#x6C0F;&#x66FF;&#x6362;&#x539F;&#x5219;liskov-substitution-principle">&#x91CC;&#x6C0F;&#x66FF;&#x6362;&#x539F;&#x5219;(Liskov Substitution Principle)</h3>
<p>&#x91CC;&#x6C0F;&#x66FF;&#x6362;&#x539F;&#x5219;&#x672C;&#x8D28;&#x5C31;&#x662F;&#x7EE7;&#x627F;&#x548C;&#x591A;&#x6001;&#x7684;&#x5E94;&#x7528;&#x3002;&#x7EE7;&#x627F;&#x4F5C;&#x4E3A;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x4E09;&#x5927;&#x7279;&#x6027;&#x4E4B;&#x4E00;&#xFF0C;&#x5728;&#x7ED9;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x5E26;&#x6765;&#x5DE8;&#x5927;&#x4FBF;&#x5229;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x4E5F;&#x5E26;&#x6765;&#x4E86;&#x5F0A;&#x7AEF;&#x3002;&#x6BD4;&#x5982;&#x4F7F;&#x7528;&#x7EE7;&#x627F;&#x4F1A;&#x7ED9;&#x7A0B;&#x5E8F;&#x5E26;&#x6765;&#x4FB5;&#x5165;&#x6027;&#xFF0C;&#x7A0B;&#x5E8F;&#x7684;&#x53EF;&#x79FB;&#x690D;&#x6027;&#x964D;&#x4F4E;&#xFF0C;&#x589E;&#x52A0;&#x4E86;&#x5BF9;&#x8C61;&#x95F4;&#x7684;&#x8026;&#x5408;&#x6027;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x7C7B;&#x88AB;&#x5176;&#x4ED6;&#x7684;&#x7C7B;&#x6240;&#x7EE7;&#x627F;&#xFF0C;&#x5219;&#x5F53;&#x8FD9;&#x4E2A;&#x7C7B;&#x9700;&#x8981;&#x4FEE;&#x6539;&#x65F6;&#xFF0C;&#x5FC5;&#x987B;&#x8003;&#x8651;&#x5230;&#x6240;&#x6709;&#x7684;&#x5B50;&#x7C7B;&#xFF0C;&#x5E76;&#x4E14;&#x7236;&#x7C7B;&#x4FEE;&#x6539;&#x540E;&#xFF0C;&#x6240;&#x6709;&#x6D89;&#x53CA;&#x5230;&#x5B50;&#x7C7B;&#x7684;&#x529F;&#x80FD;&#x90FD;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x4EA7;&#x751F;&#x6545;&#x969C;&#x3002;
&#x91CC;&#x6C0F;&#x66FF;&#x6362;&#x539F;&#x5219;&#x901A;&#x4FD7;&#x7684;&#x6765;&#x8BB2;&#x5C31;&#x662F;&#xFF1A;&#x5B50;&#x7C7B;&#x53EF;&#x4EE5;&#x6269;&#x5C55;&#x7236;&#x7C7B;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x4F46;&#x4E0D;&#x80FD;&#x6539;&#x53D8;&#x7236;&#x7C7B;&#x539F;&#x6709;&#x7684;&#x529F;&#x80FD;&#x3002;&#x5B83;&#x5305;&#x542B;&#x4EE5;&#x4E0B;4&#x5C42;&#x542B;&#x4E49;&#xFF1A;</p>
<ul>
<li>&#x5B50;&#x7C7B;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x7236;&#x7C7B;&#x7684;&#x62BD;&#x8C61;&#x65B9;&#x6CD5;&#xFF0C;&#x4F46;&#x4E0D;&#x80FD;&#x8986;&#x76D6;&#x7236;&#x7C7B;&#x7684;&#x975E;&#x62BD;&#x8C61;&#x65B9;&#x6CD5;&#x3002;</li>
<li>&#x5B50;&#x7C7B;&#x4E2D;&#x53EF;&#x4EE5;&#x589E;&#x52A0;&#x81EA;&#x5DF1;&#x7279;&#x6709;&#x7684;&#x65B9;&#x6CD5;&#x3002;</li>
<li>&#x5F53;&#x5B50;&#x7C7B;&#x7684;&#x65B9;&#x6CD5;&#x91CD;&#x8F7D;&#x7236;&#x7C7B;&#x7684;&#x65B9;&#x6CD5;&#x65F6;&#xFF0C;&#x65B9;&#x6CD5;&#x7684;&#x524D;&#x7F6E;&#x6761;&#x4EF6;&#xFF08;&#x5373;&#x65B9;&#x6CD5;&#x7684;&#x5F62;&#x53C2;&#xFF09;&#x8981;&#x6BD4;&#x7236;&#x7C7B;&#x65B9;&#x6CD5;&#x7684;&#x8F93;&#x5165;&#x53C2;&#x6570;&#x66F4;&#x5BBD;&#x677E;&#x3002;</li>
<li>&#x5F53;&#x5B50;&#x7C7B;&#x7684;&#x65B9;&#x6CD5;&#x5B9E;&#x73B0;&#x7236;&#x7C7B;&#x7684;&#x62BD;&#x8C61;&#x65B9;&#x6CD5;&#x65F6;&#xFF0C;&#x65B9;&#x6CD5;&#x7684;&#x540E;&#x7F6E;&#x6761;&#x4EF6;&#xFF08;&#x5373;&#x65B9;&#x6CD5;&#x7684;&#x8FD4;&#x56DE;&#x503C;&#xFF09;&#x8981;&#x6BD4;&#x7236;&#x7C7B;&#x66F4;&#x4E25;&#x683C;&#x3002;</li>
</ul>
<p>&#x8FD8;&#x62FF;&#x4E0A;&#x9762;&#x7684; Http &#x7C7B;&#x4E3E;&#x4F8B;&#xFF0C; &#x6211;&#x4EEC;&#x7528; Restful API &#x65B9;&#x5F0F;&#x8FDB;&#x884C; Http &#x7F51;&#x7EDC;&#x8BF7;&#x6C42;&#xFF0C;&#x4EE3;&#x7801;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code class="lang-java">    <span class="hljs-keyword">public</span> <span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">RestfulClient</span> </span>{
        ....
        <span class="hljs-function">Public <span class="hljs-title">RestfulClient</span><span class="hljs-params">(IHttp http)</span> </span>{
            <span class="hljs-keyword">this</span>.http = http != <span class="hljs-keyword">null</span> ? http : createHttp();
        }

        <span class="hljs-function"><span class="hljs-keyword">public</span> <span class="hljs-keyword">void</span> <span class="hljs-title">doGet</span><span class="hljs-params">(String url, List&lt;Header&gt; list, Body body)</span> </span>{

            ...<span class="hljs-comment">//&#x5148;&#x521B;&#x5EFA;Request</span>
            <span class="hljs-comment">//&#x53D1;&#x9001;&#x6570;&#x636E;</span>
            http.sendRequest(request)&#xFF1B;
        }

        <span class="hljs-comment">//&#x521B;&#x5EFA;IHttp &#x7C7B; TODO &#x8FD9;&#x4E2A;&#x53EF;&#x4EE5;&#x91CD;&#x6784;&#x5230;Factory &#x91CC;&#xFF0C; &#x8FD9;&#x91CC;&#x5148;&#x5077;&#x4E2A;&#x61D2;</span>
        <span class="hljs-function"><span class="hljs-keyword">public</span> <span class="hljs-keyword">static</span> IHttp <span class="hljs-title">createHttp</span><span class="hljs-params">()</span> </span>{
            <span class="hljs-comment">//&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6839;&#x636E; Android SDK &#x9009;&#x62E9;&#x4E0D;&#x540C;&#x7684;HTTP</span>
            <span class="hljs-keyword">int</span> runtimeSDKApi = Build.VERSION.SDK_INT;
            <span class="hljs-keyword">if</span> (runtimeSDKApi &gt;= GINGERBREAD_SDK_NUM) {
                <span class="hljs-keyword">return</span> <span class="hljs-keyword">new</span> HttpUrlConnImpl();
            }

            <span class="hljs-keyword">return</span> <span class="hljs-keyword">new</span> HttpClientImpl();

        }
    }
</code></pre>
<p>&#x4E0A;&#x8FF0;&#x4EE3;&#x7801;&#x4E2D;&#xFF0C; RestfulClient &#x7C7B;&#x4E2D;&#x4F9D;&#x8D56;&#x7684;&#x662F; IHttp &#x63A5;&#x53E3;&#xFF0C;&#x800C;&#x901A;&#x8FC7; createHttp &#x51FD;&#x6570;&#x8FD4;&#x56DE;&#x7684;&#x662F; IHttp &#x7684;&#x5B9E;&#x73B0;&#x7C7B; HttpClientImpl &#x6216; HttpUrlConnImpl&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x6240;&#x8C13;&#x7684;&#x91CC;&#x6C0F;&#x66FF;&#x6362;&#x539F;&#x5219;&#xFF0C;&#x4EFB;&#x4F55;&#x7236;&#x7C7B;&#x3001;&#x7236;&#x63A5;&#x53E3;&#x51FA;&#x73B0;&#x7684;&#x5730;&#x65B9;&#x5B50;&#x7C7B;&#x90FD;&#x53EF;&#x4EE5;&#x51FA;&#x73B0;&#xFF0C;&#x8FD9;&#x4E0D;&#x5C31;&#x4FDD;&#x8BC1;&#x4E86;&#x53EF;&#x6269;&#x5C55;&#x6027;&#x5417;&#xFF01;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x5C06;&#x7F51;&#x7EDC;&#x8BF7;&#x6C42;&#x5E93;&#x6539;&#x6210; OKHttp&#xFF0C; &#x662F;&#x4E0D;&#x662F;&#x5C06;&#x4F9D;&#x8D56;&#x4F20;&#x8FDB;&#x53BB;&#x5C31;&#x884C;&#x4E86;&#x3002;</p>
<p><strong>&#x4F18;&#x70B9;</strong>&#xFF1A;</p>
<ul>
<li>&#x4EE3;&#x7801;&#x5171;&#x4EAB;&#xFF0C;&#x51CF;&#x5C11;&#x521B;&#x5EFA;&#x7C7B;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#xFF0C;&#x6BCF;&#x4E2A;&#x5B50;&#x7C7B;&#x90FD;&#x62E5;&#x6709;&#x7236;&#x7C7B;&#x7684;&#x65B9;&#x6CD5;&#x548C;&#x5C5E;&#x6027;&#x3002;</li>
<li>&#x63D0;&#x9AD8;&#x4EE3;&#x7801;&#x7684;&#x91CD;&#x7528;&#x6027;&#x3002;</li>
<li>&#x63D0;&#x9AD8;&#x4EE3;&#x7801;&#x7684;&#x53EF;&#x6269;&#x5C55;&#x6027;&#xFF0C;&#x5B9E;&#x73B0;&#x7236;&#x7C7B;&#x7684;&#x65B9;&#x6CD5;&#x5C31;&#x53EF;&#x4EE5;&#x201C;&#x4E3A;&#x6240;&#x6B32;&#x4E3A;&#x201D;&#x4E86;&#xFF0C;&#x5F88;&#x591A;&#x5F00;&#x6E90;&#x6846;&#x67B6;&#x7684;&#x6269;&#x5C55;&#x63A5;&#x53E3;&#x90FD;&#x662F;&#x901A;&#x8FC7;&#x7EE7;&#x627F;&#x7236;&#x7C7B;&#x6765;&#x5B8C;&#x6210;&#x7684;&#x3002;</li>
<li>&#x63D0;&#x9AD8;&#x4EA7;&#x54C1;&#x6216;&#x9879;&#x76EE;&#x7684;&#x5F00;&#x653E;&#x6027;&#x3002;</li>
</ul>
<p><strong>&#x7F3A;&#x70B9;</strong>&#xFF1A;</p>
<ul>
<li>&#x7EE7;&#x627F;&#x662F;&#x4FB5;&#x5165;&#x6027;&#x7684;&#x3002;&#x53EA;&#x8981;&#x7EE7;&#x627F;&#xFF0C;&#x5C31;&#x5FC5;&#x987B;&#x62E5;&#x6709;&#x7236;&#x7C7B;&#x6240;&#x6709;&#x7684;&#x5C5E;&#x6027;&#x548C;&#x65B9;&#x6CD5;&#x3002;</li>
<li>&#x964D;&#x4F4E;&#x4E86;&#x4EE3;&#x7801;&#x7684;&#x7075;&#x6D3B;&#x6027;&#x3002;&#x5B50;&#x7C7B;&#x5FC5;&#x987B;&#x7236;&#x7C7B;&#x7684;&#x5C5E;&#x6027;&#x548C;&#x65B9;&#x6CD5;&#xFF0C;&#x8BA9;&#x5B50;&#x7C7B;&#x81EA;&#x7531;&#x7684;&#x4E16;&#x754C;&#x4E2D;&#x591A;&#x4E86;&#x4E9B;&#x7EA6;&#x675F;&#x3002;</li>
<li>&#x589E;&#x5F3A;&#x4E86;&#x8026;&#x5408;&#x6027;&#x3002;&#x5F53;&#x7236;&#x7C7B;&#x7684;&#x5E38;&#x4EAE;&#x3001;&#x53D8;&#x91CF;&#x548C;&#x65B9;&#x6CD5;&#x88AB;&#x4FEE;&#x6539;&#x65F6;&#xFF0C;&#x5FC5;&#x987B;&#x8981;&#x8003;&#x8651;&#x5B50;&#x7C7B;&#x7684;&#x4FEE;&#x6539;&#xFF0C;&#x800C;&#x4E14;&#x5728;&#x7F3A;&#x4E4F;&#x89C4;&#x8303;&#x7684;&#x73AF;&#x5883;&#x4E0B;&#xFF0C;&#x8FD9;&#x79CD;&#x4FEE;&#x6539;&#x53EF;&#x80FD;&#x5E26;&#x6765;&#x975E;&#x5E38;&#x7CDF;&#x7CD5;&#x7684;&#x540E;&#x679C;---&#x5927;&#x91CF;&#x7684;&#x4EE3;&#x7801;&#x9700;&#x8981;&#x91CD;&#x6784;&#x3002;</li>
</ul>
<h2 id="&#x4F9D;&#x8D56;&#x5012;&#x7F6E;&#x539F;&#x5219;dependence-inversion-principle">&#x4F9D;&#x8D56;&#x5012;&#x7F6E;&#x539F;&#x5219;(Dependence Inversion Principle)</h2>
<p>&#x7535;&#x8111;&#x5728;&#x4EE5;&#x524D;&#x7EF4;&#x4FEE;&#x7684;&#x8BDD;&#x662F;&#x6839;&#x672C;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#x4E8B;&#xFF0C;&#x53EF;&#x662F;&#x73B0;&#x5728;&#x5374;&#x7279;&#x522B;&#x5BB9;&#x6613;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x5185;&#x5B58;&#x574F;&#x4E86;&#xFF0C;&#x4E70;&#x4E2A;&#x5185;&#x5B58;&#x6761;&#xFF0C;&#x786C;&#x76D8;&#x574F;&#x4E86;&#xFF0C;&#x4E70;&#x4E2A;&#x786C;&#x76D8;&#x6362;&#x4E0A;&#x3002;&#x4E3A;&#x5565;&#x8FD9;&#x4E48;&#x65B9;&#x4FBF;&#xFF1F;&#x4ECE;&#x4FEE;&#x7535;&#x8111;&#x91CC;&#x9762;&#x5C31;&#x6709;&#x9762;&#x76F8;&#x5BF9;&#x8C61;&#x7684;&#x51E0;&#x5927;&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#xFF0C;&#x6BD4;&#x5982;&#x5355;&#x4E00;&#x804C;&#x8D23;&#x539F;&#x5219;&#xFF0C;&#x5185;&#x5B58;&#x574F;&#x4E86;&#xFF0C;&#x4E0D;&#x5E94;&#x8BE5;&#x6210;&#x4E3A;&#x66F4;&#x6362;CPU&#x7684;&#x7406;&#x7531;&#xFF0C;&#x5B83;&#x4EEC;&#x5404;&#x81EA;&#x7684;&#x804C;&#x8D23;&#x662F;&#x660E;&#x786E;&#x7684;&#x3002;&#x518D;&#x6BD4;&#x5982;&#x5F00;&#x653E;&#xFF0D;&#x5C01;&#x95ED;&#x539F;&#x5219;&#xFF0C;&#x5185;&#x5B58;&#x4E0D;&#x591F;&#x53EA;&#x8981;&#x63D2;&#x69FD;&#x8DB3;&#x591F;&#x5C31;&#x53EF;&#x4EE5;&#x6DFB;&#x52A0;&#x3002;&#x8FD8;&#x6709;&#x4F9D;&#x8D56;&#x5012;&#x8F6C;&#x539F;&#x5219;&#xFF0C;&#x539F;&#x8BDD;&#x89E3;&#x91CA;&#x662F;&#x62BD;&#x8C61;&#x4E0D;&#x5E94;&#x8BE5;&#x4F9D;&#x8D56;&#x7EC6;&#x8282;&#xFF0C;&#x7EC6;&#x8282;&#x5E94;&#x8BE5;&#x4F9D;&#x8D56;&#x4E8E;&#x62BD;&#x8C61;&#xFF0C;&#x8BF4;&#x767D;&#x4E86;&#xFF0C;&#x5C31;&#x662F;&#x8981;&#x9488;&#x5BF9;&#x63A5;&#x53E3;&#x7F16;&#x7A0B;&#xFF0C;&#x4E0D;&#x8981;&#x5BF9;&#x5B9E;&#x73B0;&#x7F16;&#x7A0B;&#xFF0C;&#x65E0;&#x8BBA;&#x4E3B;&#x677F;&#xFF0C;CPU&#xFF0C;&#x5185;&#x5B58;&#xFF0C;&#x786C;&#x76D8;&#x90FD;&#x662F;&#x9488;&#x5BF9;&#x63A5;&#x53E3;&#x8BBE;&#x8BA1;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x9488;&#x5BF9;&#x5B9E;&#x73B0;&#x6765;&#x8BBE;&#x8BA1;&#xFF0C;&#x5185;&#x5B58;&#x5C31;&#x8981;&#x5BF9;&#x5E94;&#x7684;&#x67D0;&#x4E2A;&#x54C1;&#x724C;&#x7684;&#x4E3B;&#x677F;&#xFF0C;&#x90A3;&#x5C31;&#x4F1A;&#x51FA;&#x73B0;&#x6362;&#x5185;&#x5B58;&#x9700;&#x8981;&#x628A;&#x4E3B;&#x677F;&#x4E5F;&#x6362;&#x4E86;&#x7684;&#x5C34;&#x5C2C;&#x3002;</p>
<h3 id="&#x4E3A;&#x4EC0;&#x4E48;&#x53EB;&#x53CD;&#x8F6C;&#x5462;&#xFF1F;">&#x4E3A;&#x4EC0;&#x4E48;&#x53EB;&#x53CD;&#x8F6C;&#x5462;&#xFF1F;</h3>
<p>&#x9762;&#x5BF9;&#x8FC7;&#x7A0B;&#x5F00;&#x53D1;&#x65F6;&#xFF0C;&#x4E3A;&#x4E86;&#x4F7F;&#x5F97;&#x5E38;&#x7528;&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x590D;&#x7528;&#xFF0C;&#x4E00;&#x822C;&#x90FD;&#x4F1A;&#x628A;&#x8FD9;&#x4E9B;&#x5E38;&#x7528;&#x4EE3;&#x7801;&#x5199;&#x6210;&#x8BB8;&#x8BB8;&#x591A;&#x591A;&#x51FD;&#x6570;&#x7684;&#x7A0B;&#x5E8F;&#x5E93;&#xFF0C;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x505A;&#x65B0;&#x9879;&#x76EE;&#x65F6;&#xFF0C;&#x53BB;&#x8C03;&#x7528;&#x8FD9;&#x4E9B;&#x5E95;&#x5C42;&#x7684;&#x51FD;&#x6570;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;&#x6BD4;&#x5982;&#x6211;&#x4EEC;&#x505A;&#x7684;&#x9879;&#x76EE;&#x5927;&#x591A;&#x8981;&#x8BBF;&#x95EE;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5C31;&#x628A;&#x8BBF;&#x95EE;&#x6570;&#x636E;&#x5E93;&#x7684;&#x4EE3;&#x7801;&#x5199;&#x6210;&#x4E86;&#x51FD;&#x6570;&#xFF0C;&#x6BCF;&#x6B21;&#x505A;&#x65B0;&#x9879;&#x76EE;&#x65F6;&#x5C31;&#x53BB;&#x8C03;&#x7528;&#xFF0C;&#x8FD9;&#x5C31;&#x53EB;&#x505A;&#x9AD8;&#x5C42;&#x6A21;&#x5757;&#x4F9D;&#x8D56;&#x5E95;&#x5C42;&#x6A21;&#x5757;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x8981;&#x505A;&#x65B0;&#x9879;&#x76EE;&#x662F; &#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x7684;&#x9AD8;&#x5C42;&#x6A21;&#x5757;&#x90FD;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x5BA2;&#x6237;&#x5374;&#x5E0C;&#x671B;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x5E93;&#x6216;&#x5B58;&#x50A8;&#x4FE1;&#x606F;&#x65B9;&#x5F0F;&#xFF0C;&#x8FD9;&#x65F6;&#x51FA;&#x73B0;&#x9EBB;&#x70E6;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x80FD;&#x518D;&#x6B21;&#x5229;&#x7528;&#x8FD9;&#x4E9B;&#x9AD8;&#x5C42;&#x6A21;&#x5757;&#xFF0C;&#x4F46;&#x9AD8;&#x5C42;&#x6A21;&#x5757;&#x90FD;&#x662F;&#x4E0E;&#x5E95;&#x5C42;&#x7684;&#x8BBF;&#x95EE;&#x6570;&#x636E;&#x5E93;&#x7ED1;&#x5B9A;&#x5728;&#x4E00;&#x8D77;&#x7684;&#xFF0C;&#x6CA1;&#x529E;&#x6CD5;&#x590D;&#x7528;&#x8FD9;&#x4E9B;&#x9AD8;&#x5C42;&#x6A21;&#x5757;&#xFF0C;&#x8FD9;&#x5C31;&#x975E;&#x5E38;&#x7CDF;&#x7CD5;&#x4E86;&#x3002;&#x5C31;&#x50CF;&#x521A;&#x624D;&#x8BF4;&#x7684;&#xFF0C;PC&#x91CC;&#x5982;&#x679C;CPU&#xFF0C;&#x5185;&#x5B58;&#xFF0C;&#x786C;&#x76D8;&#x90FD;&#x662F;&#x9700;&#x8981;&#x4F9D;&#x8D56;&#x5177;&#x4F53;&#x7684;&#x4E3B;&#x677F;&#xFF0C;&#x4E3B;&#x677F;&#x4E00;&#x574F;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x90E8;&#x4EF6;&#x90FD;&#x6CA1;&#x6CD5;&#x7528;&#x4E86;&#xFF0C;&#x663E;&#x7136;&#x4E0D;&#x5408;&#x7406;&#xFF0C;&#x800C;&#x5982;&#x679C;&#x4E0D;&#x7BA1;&#x9AD8;&#x5C42;&#x6A21;&#x5757;&#x8FD8;&#x662F;&#x5E95;&#x5C42;&#x6A21;&#x5757;&#xFF0C;&#x5B83;&#x4EEC;&#x90FD;&#x4F9D;&#x8D56;&#x4E8E;&#x62BD;&#x8C61;&#xFF0C;&#x5177;&#x4F53;&#x4E00;&#x70B9;&#x5C31;&#x662F;&#x63A5;&#x53E3;&#x6216;&#x8005;&#x62BD;&#x8C61;&#x7C7B;&#xFF0C;&#x53EA;&#x8981;&#x63A5;&#x53E3;&#x662F;&#x7A33;&#x5B9A;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x7684;&#x66F4;&#x6539;&#x90FD;&#x4E0D;&#x7528;&#x62C5;&#x5FC3;&#x5176;&#x5B83;&#x53D7;&#x5F71;&#x54CD;&#xFF0C;&#x8FD9;&#x5C31;&#x4F7F;&#x5F97;&#x65E0;&#x8BBA;&#x9AD8;&#x5C42;&#x6A21;&#x5757;&#x8FD8;&#x662F;&#x5E95;&#x5C42;&#x6A21;&#x5757;&#x90FD;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x88AB;&#x590D;&#x7528;&#xFF0C;&#x8FD9;&#x624D;&#x662F;&#x6700;&#x597D;&#x7684;&#x529E;&#x6CD5;&#x3002;</p>
<p>&#x5728;&#x524D;&#x9762;&#x6211;&#x4EEC;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C; RefusClient &#x5B9E;&#x73B0;&#x7C7B;&#x4F9D;&#x8D56;&#x4E8E; IHttp &#x63A5;&#x53E3;&#xFF08;&#x62BD;&#x8C61;&#xFF09;&#xFF0C;&#x800C;&#x4E0D;&#x4F9D;&#x8D56;&#x4E8E; HttpClientImpl &#x4E0E; HttpUrlConnImpl &#x5B9E;&#x73B0;&#x7C7B;&#xFF08;&#x7EC6;&#x8282;&#xFF09;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x4F9D;&#x8D56;&#x5012;&#x7F6E;&#x539F;&#x5219;&#x7684;&#x4F53;&#x73B0;&#x3002;</p>
<p>&#x4F20;&#x9012;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x6709;&#x4E09;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x4EE5;&#x4E0A;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x63A5;&#x53E3;&#x4F20;&#x9012;&#xFF0C;&#x53E6;&#x5916;&#x8FD8;&#x6709;&#x4E24;&#x79CD;&#x4F20;&#x9012;&#x65B9;&#x5F0F;&#xFF1A;&#x6784;&#x9020;&#x65B9;&#x6CD5;&#x4F20;&#x9012;&#x548C; setter &#x65B9;&#x6CD5;&#x4F20;&#x9012;&#xFF0C;&#x76F8;&#x4FE1;&#x7528;&#x8FC7; Dagger&#x3001;Spring &#x6846;&#x67B6;&#x7684;&#xFF0C;&#x5BF9;&#x4F9D;&#x8D56;&#x7684;&#x4F20;&#x9012;&#x65B9;&#x5F0F;&#x4E00;&#x5B9A;&#x4E0D;&#x4F1A;&#x964C;&#x751F;&#x3002; &#x5728;&#x5B9E;&#x9645;&#x7F16;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4E00;&#x822C;&#x9700;&#x8981;&#x505A;&#x5230;&#x5982;&#x4E0B;&#xFF1A;</p>
<ul>
<li>&#x4F4E;&#x5C42;&#x6A21;&#x5757;&#x5C3D;&#x91CF;&#x90FD;&#x8981;&#x6709;&#x62BD;&#x8C61;&#x7C7B;&#x6216;&#x63A5;&#x53E3;&#xFF0C;&#x6216;&#x8005;&#x4E24;&#x8005;&#x90FD;&#x6709;&#x3002;</li>
<li>&#x53D8;&#x91CF;&#x7684;&#x58F0;&#x660E;&#x7C7B;&#x578B;&#x5C3D;&#x91CF;&#x662F;&#x62BD;&#x8C61;&#x7C7B;&#x6216;&#x63A5;&#x53E3;&#x3002;</li>
<li>&#x4F7F;&#x7528;&#x7EE7;&#x627F;&#x65F6;&#x9075;&#x5FAA;&#x91CC;&#x6C0F;&#x66FF;&#x6362;&#x539F;&#x5219;&#x3002; &#x4F9D;&#x8D56;&#x5012;&#x7F6E;&#x539F;&#x5219;&#x7684;&#x6838;&#x5FC3;&#x5C31;&#x662F;&#x8981;&#x6211;&#x4EEC;&#x9762;&#x5411;&#x63A5;&#x53E3;&#x7F16;&#x7A0B;&#x3002;
<strong>&#x4F18;&#x70B9;</strong>&#xFF1A;</li>
<li>&#x53EF;&#x6269;&#x5C55;&#x6027;&#x597D;</li>
<li>&#x8026;&#x5408;&#x5EA6;&#x4F4E;</li>
</ul>
<h2 id="&#x63A5;&#x53E3;&#x9694;&#x79BB;&#x539F;&#x5219;interface-segregation-principle">&#x63A5;&#x53E3;&#x9694;&#x79BB;&#x539F;&#x5219;(Interface Segregation Principle)</h2>
<p>&#x63A5;&#x53E3;&#x9694;&#x79BB;&#x539F;&#x5219;&#xFF08;&#x82F1;&#x8BED;&#xFF1A;interface-segregation principles&#xFF0C; &#x7F29;&#x5199;&#xFF1A;ISP&#xFF09;&#x6307;&#x660E;&#x6CA1;&#x6709;&#x5BA2;&#x6237;(client)&#x5E94;&#x8BE5;&#x88AB;&#x8FEB;&#x4F9D;&#x8D56;&#x4E8E;&#x5B83;&#x4E0D;&#x4F7F;&#x7528;&#x65B9;&#x6CD5;&#x3002;&#x63A5;&#x53E3;&#x9694;&#x79BB;&#x539F;&#x5219;(ISP)&#x62C6;&#x5206;&#x975E;&#x5E38;&#x5E9E;&#x5927;&#x81C3;&#x80BF;&#x7684;&#x63A5;&#x53E3;&#x6210;&#x4E3A;&#x66F4;&#x5C0F;&#x7684;&#x548C;&#x66F4;&#x5177;&#x4F53;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x8FD9;&#x6837;&#x5BA2;&#x6237;&#x5C06;&#x4F1A;&#x53EA;&#x9700;&#x8981;&#x77E5;&#x9053;&#x4ED6;&#x4EEC;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x8FD9;&#x79CD;&#x7F29;&#x5C0F;&#x7684;&#x63A5;&#x53E3;&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;&#x89D2;&#x8272;&#x63A5;&#x53E3;&#xFF08;role interfaces&#xFF09;&#x3002;&#x63A5;&#x53E3;&#x9694;&#x79BB;&#x539F;&#x5219;(ISP)&#x7684;&#x76EE;&#x7684;&#x662F;&#x7CFB;&#x7EDF;&#x89E3;&#x5F00;&#x8026;&#x5408;&#xFF0C;&#x4ECE;&#x800C;&#x5BB9;&#x6613;&#x91CD;&#x6784;&#xFF0C;&#x66F4;&#x6539;&#x548C;&#x91CD;&#x65B0;&#x90E8;&#x7F72;&#x3002;&#x63A5;&#x53E3;&#x9694;&#x79BB;&#x539F;&#x5219;&#x662F;&#x5728;SOLID (&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x8BBE;&#x8BA1;)&#x4E2D;&#x4E94;&#x4E2A;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x8BBE;&#x8BA1;(OOD)&#x7684;&#x539F;&#x5219;&#x4E4B;&#x4E00;&#xFF0C;&#x7C7B;&#x4F3C;&#x4E8E;&#x5728;GRASP (&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x8BBE;&#x8BA1;)&#x4E2D;&#x7684;&#x9AD8;&#x5185;&#x805A;&#x6027;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x662F;&#x770B;&#x5230;&#x7F51;&#x4E0A;&#x7684;&#x4E3E;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;</p>
<blockquote>
<p>&#x53EF;&#x80FD;&#x63CF;&#x8FF0;&#x8D77;&#x6765;&#x4E0D;&#x662F;&#x5F88;&#x597D;&#x7406;&#x89E3;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x662F;&#x4EE5;&#x793A;&#x4F8B;&#x6765;&#x52A0;&#x5F3A;&#x7406;&#x89E3;&#x5427;&#x3002; &#x6211;&#x4EEC;&#x77E5;&#x9053;&#xFF0C;&#x5728;&#x7F51;&#x7EDC;&#x6846;&#x67B6;&#x4E2D;&#xFF0C;&#x7F51;&#x7EDC;&#x961F;&#x5217;&#x4E2D;&#x662F;&#x4F1A;&#x5BF9;&#x8BF7;&#x6C42;&#x8FDB;&#x884C;&#x6392;&#x5E8F;&#x7684;&#x3002;&#x5185;&#x90E8;&#x4F7F;&#x7528; PriorityBlockingQueue &#x6765;&#x7EF4;&#x62A4;&#x7F51;&#x7EDC;&#x8BF7;&#x6C42;&#x961F;&#x5217;&#xFF0C;PriorityBlockingQueue &#x9700;&#x8981;&#x8C03;&#x7528; Request &#x7C7B;&#x7684;&#x6392;&#x5E8F;&#x65B9;&#x6CD5;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#xFF0C;&#x5176;&#x4ED6;&#x7684;&#x63A5;&#x53E3;&#x4ED6;&#x6839;&#x672C;&#x4E0D;&#x9700;&#x8981;&#xFF0C;&#x5373; PriorityBlockingQueue &#x53EA;&#x9700;&#x8981; compareTo &#x8FD9;&#x4E2A;&#x63A5;&#x53E3;&#xFF0C;&#x800C;&#x8FD9;&#x4E2A; compareTo &#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x6240;&#x8BF4;&#x7684;&#x6700;&#x5C0F;&#x63A5;&#x53E3;&#x65B9;&#x6CD5;&#xFF0C;&#x800C;&#x662F; Java &#x4E2D;&#x7684; Comparable &#x63A5;&#x53E3;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x662F;&#x6307;&#x4E3A;&#x4E86;&#x5B66;&#x4E60;&#xFF0C;&#x81F3;&#x4E8E;&#x54EA;&#x91CC;&#x5B9A;&#x4E49;&#x7684;&#x65E0;&#x5173;&#x7D27;&#x8981;&#x3002;</p>
<p>&#x5728;&#x5143;&#x7D20;&#x6392;&#x5E8F;&#x65F6;&#xFF0C;PriorityBlockingQueue &#x53EA;&#x9700;&#x8981;&#x77E5;&#x9053;&#x5143;&#x7D20;&#x662F;&#x4E2A; Comparable &#x5BF9;&#x8C61;&#x5373;&#x53EF;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x662F;&#x4E0D;&#x662F; Request &#x7C7B;&#x4EE5;&#x53CA;&#x8FD9;&#x4E2A;&#x7C7B;&#x7684;&#x5176;&#x4ED6;&#x63A5;&#x53E3;&#x3002;&#x5B83;&#x53EA;&#x9700;&#x8981;&#x6392;&#x5E8F;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x53EA;&#x8981;&#x77E5;&#x9053;&#x5B83;&#x662F;&#x5B9E;&#x73B0;&#x4E86; Comparable &#x5BF9;&#x8C61;&#x5373;&#x53EF;&#xFF0C;Comparable &#x5C31;&#x662F;&#x5B83;&#x7684;&#x6700;&#x5C0F;&#x63A5;&#x53E3;&#xFF0C;&#x4E5F;&#x662F;&#x901A;&#x8FC7; Comparable &#x9694;&#x79BB;&#x4E86; PriorityBlockingQueue &#x7C7B;&#x5BF9; Request &#x7C7B;&#x7684;&#x5176;&#x4ED6;&#x65B9;&#x6CD5;&#x7684;&#x53EF;&#x89C1;&#x6027;&#x3002;</p>
</blockquote>
<p>&#x5F88;&#x591A;&#x4EBA;&#x4F1A;&#x89C9;&#x7684;&#x63A5;&#x53E3;&#x9694;&#x79BB;&#x539F;&#x5219;&#x8DDF;&#x4E4B;&#x524D;&#x7684;&#x5355;&#x4E00;&#x804C;&#x8D23;&#x539F;&#x5219;&#x5F88;&#x76F8;&#x4F3C;&#xFF0C;&#x5176;&#x5B9E;&#x4E0D;&#x7136;&#x3002;&#x5176;&#x4E00;&#xFF0C;&#x5355;&#x4E00;&#x804C;&#x8D23;&#x539F;&#x5219;&#x539F;&#x6CE8;&#x91CD;&#x7684;&#x662F;&#x804C;&#x8D23;&#xFF1B;&#x800C;&#x63A5;&#x53E3;&#x9694;&#x79BB;&#x539F;&#x5219;&#x6CE8;&#x91CD;&#x5BF9;&#x63A5;&#x53E3;&#x4F9D;&#x8D56;&#x7684;&#x9694;&#x79BB;&#x3002;&#x5176;&#x4E8C;&#xFF0C;&#x5355;&#x4E00;&#x804C;&#x8D23;&#x539F;&#x5219;&#x4E3B;&#x8981;&#x662F;&#x7EA6;&#x675F;&#x7C7B;&#xFF0C;&#x5176;&#x6B21;&#x624D;&#x662F;&#x63A5;&#x53E3;&#x548C;&#x65B9;&#x6CD5;&#xFF0C;&#x5B83;&#x9488;&#x5BF9;&#x7684;&#x662F;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x5B9E;&#x73B0;&#x548C;&#x7EC6;&#x8282;&#xFF1B;&#x800C;&#x63A5;&#x53E3;&#x9694;&#x79BB;&#x539F;&#x5219;&#x4E3B;&#x8981;&#x7EA6;&#x675F;&#x63A5;&#x53E3;&#x63A5;&#x53E3;&#xFF0C;&#x4E3B;&#x8981;&#x9488;&#x5BF9;&#x62BD;&#x8C61;&#xFF0C;&#x9488;&#x5BF9;&#x7A0B;&#x5E8F;&#x6574;&#x4F53;&#x6846;&#x67B6;&#x7684;&#x6784;&#x3002; &#x91C7;&#x7528;&#x63A5;&#x53E3;&#x9694;&#x79BB;&#x539F;&#x5219;&#x5BF9;&#x63A5;&#x53E3;&#x8FDB;&#x884C;&#x7EA6;&#x675F;&#x65F6;&#xFF0C;&#x8981;&#x6CE8;&#x610F;&#x4EE5;&#x4E0B;&#x51E0;&#x70B9;&#xFF1A;</p>
<ul>
<li>&#x63A5;&#x53E3;&#x5C3D;&#x91CF;&#x5C0F;&#xFF0C;&#x4F46;&#x662F;&#x8981;&#x6709;&#x9650;&#x5EA6;&#x3002;&#x5BF9;&#x63A5;&#x53E3;&#x8FDB;&#x884C;&#x7EC6;&#x5316;&#x53EF;&#x4EE5;&#x63D0;&#x9AD8;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x7075;&#x6D3B;&#x6027;&#x662F;&#x4E0D;&#x6323;&#x7684;&#x4E8B;&#x5B9E;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x8FC7;&#x5C0F;&#xFF0C;&#x5219;&#x4F1A;&#x9020;&#x6210;&#x63A5;&#x53E3;&#x6570;&#x91CF;&#x8FC7;&#x591A;&#xFF0C;&#x4F7F;&#x8BBE;&#x8BA1;&#x590D;&#x6742;&#x5316;&#x3002;&#x6240;&#x4EE5;&#x4E00;&#x5B9A;&#x8981;&#x9002;&#x5EA6;&#x3002;</li>
<li>&#x4E3A;&#x4F9D;&#x8D56;&#x63A5;&#x53E3;&#x7684;&#x7C7B;&#x5B9A;&#x5236;&#x670D;&#x52A1;&#xFF0C;&#x53EA;&#x66B4;&#x9732;&#x7ED9;&#x8C03;&#x7528;&#x7684;&#x7C7B;&#x5B83;&#x9700;&#x8981;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5B83;&#x4E0D;&#x9700;&#x8981;&#x7684;&#x65B9;&#x6CD5;&#x5219;&#x9690;&#x85CF;&#x8D77;&#x6765;&#x3002;&#x53EA;&#x6709;&#x4E13;&#x6CE8;&#x5730;&#x4E3A;&#x4E00;&#x4E2A;&#x6A21;&#x5757;&#x63D0;&#x4F9B;&#x5B9A;&#x5236;&#x670D;&#x52A1;&#xFF0C;&#x624D;&#x80FD;&#x5EFA;&#x7ACB;&#x6700;&#x5C0F;&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x3002;</li>
<li>&#x63D0;&#x9AD8;&#x5185;&#x805A;&#xFF0C;&#x51CF;&#x5C11;&#x5BF9;&#x5916;&#x4EA4;&#x4E92;&#x3002;&#x4F7F;&#x63A5;&#x53E3;&#x7528;&#x6700;&#x5C11;&#x7684;&#x65B9;&#x6CD5;&#x53BB;&#x5B8C;&#x6210;&#x6700;&#x591A;&#x7684;&#x4E8B;&#x60C5;&#x3002; &#x8FD0;&#x7528;&#x63A5;&#x53E3;&#x9694;&#x79BB;&#x539F;&#x5219;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x9002;&#x5EA6;&#xFF0C;&#x63A5;&#x53E3;&#x8BBE;&#x8BA1;&#x7684;&#x8FC7;&#x5927;&#x6216;&#x8FC7;&#x5C0F;&#x90FD;&#x4E0D;&#x597D;&#x3002;&#x8BBE;&#x8BA1;&#x63A5;&#x53E3;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53EA;&#x6709;&#x591A;&#x82B1;&#x4E9B;&#x65F6;&#x95F4;&#x53BB;&#x601D;&#x8003;&#x548C;&#x7B79;&#x5212;&#xFF0C;&#x624D;&#x80FD;&#x51C6;&#x786E;&#x5730;&#x5B9E;&#x8DF5;&#x8FD9;&#x4E00;&#x539F;&#x5219;&#x3002;</li>
</ul>
<h2 id="&#x8FEA;&#x7C73;&#x7279;&#x539F;&#x5219;-law-of-demeter">&#x8FEA;&#x7C73;&#x7279;&#x539F;&#x5219;( Law of Demeter)</h2>
<p>&#x8FEA;&#x7C73;&#x7279;&#x539F;&#x5219;&#xFF08;Law of Demeter&#xFF0C;&#x7F29;&#x5199;LoD&#xFF09;&#x7B49;&#x540C;&#x4E8E;&#x201C;&#x6700;&#x5C11;&#x77E5;&#x8BC6;&#x539F;&#x5219;&#xFF08;Principle of Least Knowledge&#xFF09;&#x201D;&#xFF0C;&#x662F;&#x4E00;&#x79CD;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x7684;&#x8BBE;&#x8BA1;&#x6307;&#x5BFC;&#x539F;&#x5219;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x3002;&#x8FEA;&#x7C73;&#x7279;&#x539F;&#x5219;&#x662F;&#x677E;&#x8026;&#x5408;&#x7684;&#x4E00;&#x79CD;&#x5177;&#x4F53;&#x6848;&#x4F8B;&#x3002;&#x8BE5;&#x539F;&#x5219;&#x662F;&#x7F8E;&#x56FD;&#x4E1C;&#x5317;&#x5927;&#x5B66;&#x5728;1987&#x5E74;&#x672B;&#x5728;&#x53D1;&#x660E;&#x7684;&#xFF0C;&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x5730;&#x4EE5;&#x4E0B;&#x9762;&#x4EFB;&#x4E00;&#x4E2D;&#x65B9;&#x5F0F;&#x603B;&#x7ED3;&#x3002;</p>
<p>&#x6BCF;&#x4E2A;&#x5355;&#x5143;&#x5BF9;&#x4E8E;&#x5176;&#x4ED6;&#x7684;&#x5355;&#x5143;&#x53EA;&#x80FD;&#x62E5;&#x6709;&#x6709;&#x9650;&#x7684;&#x77E5;&#x8BC6;&#xFF1A;&#x53EA;&#x662F;&#x4E0E;&#x5F53;&#x524D;&#x5355;&#x5143;&#x7D27;&#x5BC6;&#x8054;&#x7CFB;&#x7684;&#x5355;&#x5143;&#xFF1B; &#x6BCF;&#x4E2A;&#x5355;&#x5143;&#x53EA;&#x80FD;&#x548C;&#x5B83;&#x7684;&#x670B;&#x53CB;&#x4EA4;&#x8C08;&#xFF1A;&#x4E0D;&#x80FD;&#x548C;&#x964C;&#x751F;&#x5355;&#x5143;&#x4EA4;&#x8C08;&#xFF1B; &#x53EA;&#x548C;&#x81EA;&#x5DF1;&#x76F4;&#x63A5;&#x7684;&#x670B;&#x53CB;&#x4EA4;&#x8C08;&#x3002; &#x8FD9;&#x4E2A;&#x539F;&#x7406;&#x7684;&#x540D;&#x79F0;&#x6765;&#x6E90;&#x4E8E;&#x5E0C;&#x814A;&#x795E;&#x8BDD;&#x4E2D;&#x7684;&#x519C;&#x4E1A;&#x5973;&#x795E;&#xFF0C;&#x5B64;&#x72EC;&#x7684;&#x5F97;&#x58A8;&#x5FD2;&#x8033;&#x3002;</p>
<p>&#x5F88;&#x591A;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x8BED;&#x8A00;&#x7528;&quot;.&quot;&#x8868;&#x793A;&#x5BF9;&#x8C61;&#x7684;&#x57DF;&#x7684;&#x89E3;&#x6790;&#x7B97;&#x7B26;&#xFF0C;&#x56E0;&#x6B64;&#x8FEA;&#x7C73;&#x7279;&#x539F;&#x5219;&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x5730;&#x9648;&#x8FF0;&#x4E3A;&#x201C;&#x53EA;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;.&#x7B97;&#x7B26;&#x201D;&#x3002;&#x56E0;&#x6B64;&#xFF0C;a.b.Method()&#x8FDD;&#x53CD;&#x4E86;&#x6B64;&#x5B9A;&#x5F8B;&#xFF0C;&#x800C;a.Method()&#x4E0D;&#x8FDD;&#x53CD;&#x6B64;&#x5B9A;&#x5F8B;&#x3002;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x4F8B;&#x5B50;&#x662F;&#xFF0C;&#x4EBA;&#x53EF;&#x4EE5;&#x547D;&#x4EE4;&#x4E00;&#x6761;&#x72D7;&#x884C;&#x8D70;&#xFF08;walk&#xFF09;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x5E94;&#x8BE5;&#x76F4;&#x63A5;&#x6307;&#x6325;&#x72D7;&#x7684;&#x817F;&#x884C;&#x8D70;&#xFF0C;&#x5E94;&#x8BE5;&#x7531;&#x72D7;&#x53BB;&#x6307;&#x6325;&#x63A7;&#x5236;&#x5B83;&#x7684;&#x817F;&#x5982;&#x4F55;&#x884C;&#x8D70;&#x3002;</p>
<p>&#x901A;&#x4FD7;&#x5730;&#x8BB2;&#xFF0C;&#x4E00;&#x4E2A;&#x7C7B;&#x5E94;&#x8BE5;&#x5BF9;&#x81EA;&#x5DF1;&#x9700;&#x8981;&#x8026;&#x5408;&#x6216;&#x8005;&#x8C03;&#x7528;&#x7684;&#x7C7B;&#x77E5;&#x9053;&#x5F97;&#x6700;&#x5C11;&#xFF0C;&#x8FD9;&#x6709;&#x70B9;&#x7C7B;&#x4F3C;&#x4E8E;&#x63A5;&#x53E3;&#x9694;&#x79BB;&#x539F;&#x5219;&#x4E2D;&#x7684;&#x6700;&#x5C0F;&#x63A5;&#x53E3;&#x7684;&#x6982;&#x5FF5;&#x3002;&#x7C7B;&#x7684;&#x5185;&#x90E8;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x3001;&#x5982;&#x4F55;&#x590D;&#x6742;&#x90FD;&#x4E0E;&#x8C03;&#x7528;&#x8005;&#x6216;&#x8005;&#x4F9D;&#x8D56;&#x8005;&#x6CA1;&#x6709;&#x5173;&#x7CFB;&#xFF0C;&#x8C03;&#x7528;&#x8005;&#x6216;&#x8005;&#x4F9D;&#x8D56;&#x8005;&#x53EA;&#x9700;&#x8981;&#x77E5;&#x9053;&#x5B83;&#x9700;&#x8981;&#x5B83;&#x9700;&#x8981;&#x7684;&#x65B9;&#x6CD5;&#x5373;&#x53EF;&#xFF0C;&#x5176;&#x4ED6;&#x7684;&#x4E00;&#x6982;&#x4E0D;&#x5173;&#x5FC3;&#x3002;&#x7C7B;&#x4E0E;&#x7C7B;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x8D8A;&#x5BC6;&#x5207;&#xFF0C;&#x8026;&#x5408;&#x5EA6;&#x8D8A;&#x5927;&#xFF0C;&#x5F53;&#x4E00;&#x4E2A;&#x7C7B;&#x53D1;&#x751F;&#x6539;&#x53D8;&#x65F6;&#xFF0C;&#x5BF9;&#x53E6;&#x4E00;&#x4E2A;&#x7C7B;&#x7684;&#x5F71;&#x54CD;&#x4E5F;&#x8D8A;&#x5927;&#x3002;</p>
<p><strong>&#x4F18;&#x70B9;</strong>&#xFF1A;</p>
<ul>
<li>&#x964D;&#x4F4E;&#x590D;&#x6742;&#x5EA6;</li>
<li>&#x964D;&#x4F4E;&#x8026;&#x5408;&#x6027;</li>
<li>&#x589E;&#x52A0;&#x7A33;&#x5B9A;&#x6027;</li>
</ul>
<h2 id="&#x5F00;&#x95ED;&#x539F;&#x5219;open-close-principle">&#x5F00;&#x95ED;&#x539F;&#x5219;(Open-Close Principle)</h2>
<p>&#x5F00;&#x95ED;&#x539F;&#x5219;&#x662F; Java &#x4E16;&#x754C;&#x91CC;&#x6700;&#x57FA;&#x7840;&#x7684;&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#xFF0C;&#x5B83;&#x6307;&#x5BFC;&#x6211;&#x4EEC;&#x5982;&#x4F55;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x7A33;&#x5B9A;&#x7684;&#x3001;&#x7075;&#x6D3B;&#x7684;&#x7CFB;&#x7EDF;&#x3002;&#x5F00;&#x95ED;&#x539F;&#x5219;&#x7684;&#x5B9A;&#x4E49;&#x662F;&#xFF1A;&#x4E00;&#x4E2A;&#x8F6F;&#x4EF6;&#x5B9E;&#x4F53;&#x7C7B;&#xFF0C;&#x6A21;&#x5757;&#x548C;&#x51FD;&#x6570;&#x5E94;&#x8BE5;&#x5BF9;&#x6269;&#x5C55;&#x5F00;&#x653E;&#xFF0C;&#x5BF9;&#x4FEE;&#x6539;&#x5173;&#x95ED;&#x3002;&#x5728;&#x8F6F;&#x4EF6;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x5185;&#xFF0C;&#x56E0;&#x4E3A;&#x53D8;&#x5316;&#x3001;&#x5347;&#x7EA7;&#x548C;&#x7EF4;&#x62A4;&#x7B49;&#x539F;&#x56E0;&#xFF0C;&#x9700;&#x8981;&#x5BF9;&#x8F6F;&#x4EF6;&#x539F;&#x6709;&#x7684;&#x4EE3;&#x7801;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#x65F6;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x7ED9;&#x65E7;&#x4EE3;&#x7801;&#x5F15;&#x5165;&#x9519;&#x8BEF;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5F53;&#x8F6F;&#x4EF6;&#x9700;&#x8981;&#x53D8;&#x5316;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x5C3D;&#x91CF;&#x901A;&#x8FC7;&#x6269;&#x5C55;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x5B9E;&#x73B0;&#x53D8;&#x5316;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x901A;&#x8FC7;&#x4FEE;&#x6539;&#x5DF2;&#x6709;&#x7684;&#x4EE3;&#x7801;&#x6765;&#x5B9E;&#x73B0;&#x3002;</p>
<p>&#x5728;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6C38;&#x8FDC;&#x4E0D;&#x53D8;&#x7684;&#x5C31;&#x662F;&#x53D8;&#x5316;&#x3002;&#x5F00;&#x95ED;&#x539F;&#x5219;&#x662F;&#x4F7F;&#x6211;&#x4EEC;&#x7684;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x62E5;&#x62B1;&#x53D8;&#x5316;&#x7684;&#x6838;&#x5FC3;&#x539F;&#x5219;&#x4E4B;&#x4E00;&#x3002;&#x5BF9;&#x6269;&#x5C55;&#x5F00;&#x653E;&#xFF0C;&#x5BF9;&#x4FEE;&#x6539;&#x5173;&#x95ED;&#x8FD9;&#x6837;&#x7684;&#x9AD8;&#x5C42;&#x6B21;&#x6982;&#x62EC;&#xFF0C;&#x5373;&#x5728;&#x9700;&#x8981;&#x5BF9;&#x8F6F;&#x4EF6;&#x8FDB;&#x884C;&#x5347;&#x7EA7;&#x3001;&#x53D8;&#x5316;&#x65F6;&#x5E94;&#x8BE5;&#x901A;&#x8FC7;&#x6269;&#x5C55;&#x7684;&#x5F62;&#x5F0F;&#x6765;&#x5B9E;&#x73B0;&#xFF0C;&#x800C;&#x975E;&#x4FEE;&#x6539;&#x539F;&#x6709;&#x4EE3;&#x7801;&#x3002;&#x5F53;&#x7136;&#x8FD9;&#x53EA;&#x662F;&#x4E00;&#x79CD;&#x6BD4;&#x8F83;&#x7406;&#x60F3;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x662F;&#x901A;&#x8FC7;&#x6269;&#x5C55;&#x8FD8;&#x662F;&#x901A;&#x8FC7;&#x4FEE;&#x6539;&#x65E7;&#x4EE3;&#x7801;&#x9700;&#x8981;&#x4F9D;&#x636E;&#x4EE3;&#x7801;&#x81EA;&#x8EAB;&#x6765;&#x5B9A;&#x3002;</p>
<p>&#x8FD8;&#x662F;&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#xFF0C; HttpUrlConnImpl &#x548C; HttpClientImpl &#x5B9E;&#x73B0;&#x4E86; IHttp &#x63A5;&#x53E3;&#xFF0C; &#x5F53;&#x6211;&#x4EEC;&#x5B9E;&#x73B0; OKHttp &#x7684;&#x65F6;&#x5019;&#x5C31;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0; HttpOKImpl&#xFF0C; &#x8FD9;&#x6837;&#x901A;&#x8FC7;&#x6269;&#x5C55;&#x7684;&#x5F62;&#x5F0F;&#x6765;&#x5E94;&#x5BF9;&#x8F6F;&#x4EF6;&#x7684;&#x53D8;&#x5316;&#x6216;&#x8005;&#x8BF4;&#x7528;&#x6237;&#x9700;&#x6C42;&#x7684;&#x591A;&#x6837;&#x6027;&#xFF0C;&#x65E2;&#x907F;&#x514D;&#x4E86;&#x7834;&#x574F;&#x539F;&#x6709;&#x7CFB;&#x7EDF;&#xFF0C;&#x53C8;&#x4FDD;&#x8BC1;&#x4E86;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x53EF;&#x7EF4;&#x62A4;&#x6027;&#x3002;&#x4F9D;&#x8D56;&#x4E8E;&#x62BD;&#x8C61;&#xFF0C;&#x800C;&#x4E0D;&#x4F9D;&#x8D56;&#x4E8E;&#x5177;&#x4F53;&#xFF0C;&#x4F7F;&#x5F97;&#x5BF9;&#x6269;&#x5C55;&#x5F00;&#x653E;&#xFF0C;&#x5BF9;&#x4FEE;&#x6539;&#x5173;&#x95ED;&#x3002;&#x5F00;&#x95ED;&#x539F;&#x5219;&#x4E0E;&#x4F9D;&#x8D56;&#x5012;&#x7F6E;&#x539F;&#x5219;&#xFF0C;&#x91CC;&#x6C0F;&#x66FF;&#x6362;&#x539F;&#x5219;&#x4E00;&#x6837;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x90FD;&#x9075;&#x5FAA;&#x4E00;&#x53E5;&#x8BDD;&#xFF1A;&#x9762;&#x5411;&#x63A5;&#x53E3;&#x7F16;&#x7A0B;&#x3002;</p>
<p><strong>&#x4F18;&#x70B9;</strong>&#xFF1A;</p>
<ul>
<li>&#x589E;&#x52A0;&#x7A33;&#x5B9A;&#x6027;</li>
<li>&#x53EF;&#x6269;&#x5C55;&#x6027;&#x9AD8;</li>
</ul>
<h3 id="&#x907F;&#x514D;&#x6389;&#x8FDB;&#x8FC7;&#x5EA6;&#x8BBE;&#x8BA1;&#x7684;&#x602A;&#x5708;">&#x907F;&#x514D;&#x6389;&#x8FDB;&#x8FC7;&#x5EA6;&#x8BBE;&#x8BA1;&#x7684;&#x602A;&#x5708;</h3>
<p>&#x5F53;&#x4F60;&#x638C;&#x63E1;&#x4E00;&#x4E9B;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x6216;&#x8005;&#x624B;&#x6CD5;&#x4E4B;&#x540E;&#xFF0C;&#x6BD4;&#x8F83;&#x5BB9;&#x6613;&#x51FA;&#x73B0;&#x7684;&#x95EE;&#x9898;&#x5C31;&#x662F;&#x8FC7;&#x5EA6;&#x8BBE;&#x8BA1;&#x3002;&#x6709;&#x7684;&#x4EBA;&#x751A;&#x81F3;&#x5728;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x4E2D;&#x4E00;&#x5B9A;&#x8981;&#x5C06; 23 &#x79CD;&#x5E38;&#x89C1;&#x7684;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x8FD0;&#x7528;&#x4E0A;&#xFF0C;&#x8FD9;&#x5C31;&#x672C;&#x672B;&#x5012;&#x7F6E;&#x4E86;&#x3002;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x7684;&#x56DB;&#x5927;&#x8981;&#x7D20;&#x4E2D;&#x5C31;&#x660E;&#x786E;&#x6307;&#x51FA;&#xFF0C;&#x6A21;&#x5F0F;&#x7684;&#x8FD0;&#x7528;&#x5E94;&#x8BE5;&#x6839;&#x636E;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x6240;&#x9762;&#x4E34;&#x7684;&#x95EE;&#x9898;&#x6765;&#x51B3;&#x5B9A;&#x662F;&#x5426;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x73B0;&#x6709;&#x7684;&#x8BBE;&#x8BA1;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x518D;&#x51FA;&#x73B0;&#x95EE;&#x9898;&#x6216;&#x8005;&#x4F60;&#x9884;&#x8BA1;&#x4F1A;&#x51FA;&#x73B0;&#x90A3;&#x6837;&#x7684;&#x95EE;&#x9898;&#x65F6;&#xFF0C;&#x624D;&#x63A8;&#x8350;&#x4F7F;&#x7528;&#x7279;&#x5B9A;&#x7684;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5C06;&#x5404;&#x79CD;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x5957;&#x8FDB;&#x4F60;&#x7684;&#x8F6F;&#x4EF6;&#x4E2D;&#x3002;</p>
<p>&#x4E0D;&#x7BA1;&#x5728;&#x8BBE;&#x8BA1;&#x3001;&#x5B9E;&#x73B0;&#x3001;&#x6D4B;&#x8BD5;&#x4E4B;&#x95F4;&#x6709;&#x591A;&#x5C11;&#x65F6;&#x95F4;&#x90FD;&#x5E94;&#x8BE5;&#x907F;&#x514D;&#x8FC7;&#x5EA6;&#x8BBE;&#x8BA1;&#xFF0C;&#x5B83;&#x4F1A;&#x6253;&#x7834;&#x4F60;&#x7684;&#x53CD;&#x9988;&#x56DE;&#x8DEF;&#xFF0C;&#x4F7F;&#x4F60;&#x7684;&#x8BBE;&#x8BA1;&#x5F97;&#x4E0D;&#x5230;&#x53CD;&#x9988;&#xFF0C;&#x4ECE;&#x800C;&#x6162;&#x6162;&#x9677;&#x5165;&#x5371;&#x9669;&#x4E2D;&#x3002;&#x6240;&#x4EE5;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x4FDD;&#x6301;&#x7B80;&#x5355;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x6709;&#x65F6;&#x95F4;&#x6765;&#x6D4B;&#x8BD5;&#x8BE5;&#x8BBE;&#x8BA1;&#x662F;&#x5426;&#x771F;&#x7684;&#x53EF;&#x884C;&#xFF0C;&#x7136;&#x540E;&#x4F5C;&#x51FA;&#x6700;&#x540E;&#x7684;&#x51B3;&#x7B56;&#x3002;</p>
<p>&#x5F53;&#x8BBE;&#x8BA1;&#x4E00;&#x6B3E;&#x8F6F;&#x4EF6;&#x65F6;&#xFF0C;&#x4ECE;&#x6574;&#x4F53;&#x9AD8;&#x5EA6;&#x4E0A;&#x8BBE;&#x5B9A;&#x4E00;&#x79CD;&#x67B6;&#x6784;&#x6A21;&#x5F0F;&#xFF0C;&#x786E;&#x5B9A;&#x5E94;&#x7528;&#x7684;&#x6574;&#x4F53;&#x67B6;&#x6784;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x5206;&#x6790;&#x4E00;&#x4E9B;&#x91CD;&#x8981;&#x7684;&#x8BBE;&#x8BA1;&#x601D;&#x8DEF;&#xFF0C;&#x5E76;&#x4E14;&#x4FDD;&#x8BC1;&#x4ED6;&#x4EEC;&#x7684;&#x7B80;&#x5355;&#x6027;&#x3001;&#x6E05;&#x6670;&#x6027;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x65F6;&#x95F4;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; Java &#x4EE3;&#x7801;&#x6A21;&#x62DF;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x539F;&#x578B;&#xFF0C;&#x786E;&#x4FDD;&#x8BBE;&#x8BA1;&#x662F;&#x53EF;&#x884C;&#x7684;&#xFF0C;&#x6700;&#x540E;&#x5C31;&#x53EF;&#x4EE5;&#x4ED8;&#x8BF8;&#x884C;&#x52A8;&#x4E86;&#x3002;&#x5207;&#x5B9E;&#x4E0D;&#x8981;&#x8FC7;&#x5EA6;&#x7684;&#x8FFD;&#x6C42;&#x8BBE;&#x8BA1;&#xFF0C;&#x9002;&#x5F53;&#x5C31;&#x597D;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#x6216;&#x8005;&#x9884;&#x8BA1;&#x5230;&#x5C06;&#x8981;&#x51FA;&#x73B0;&#x95EE;&#x9898;&#x65F6;&#xFF0C;&#x5728;&#x5224;&#x65AD;&#x662F;&#x5426;&#x9700;&#x8981;&#x8FD0;&#x7528;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="dependency.html" class="navigation navigation-prev " aria-label="Previous page: 依赖关系">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="../creator-mode/creator-mode.html" class="navigation navigation-next " aria-label="Next page: 创建型模式">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"设计模式原则","level":"1.3","depth":1,"next":{"title":"创建型模式","level":"1.4","depth":1,"path":"creator-mode/creator-mode.md","ref":"creator-mode/creator-mode.md","articles":[{"title":"简单工厂模式","level":"1.4.1","depth":2,"path":"creator-mode/simple-factory/simple-factory.md","ref":"creator-mode/simple-factory/simple-factory.md","articles":[]},{"title":"工厂方法模式","level":"1.4.2","depth":2,"path":"creator-mode/factory-method/factory-method.md","ref":"creator-mode/factory-method/factory-method.md","articles":[]},{"title":"抽象工厂模式","level":"1.4.3","depth":2,"path":"creator-mode/abstract-factory/abstract-factory.md","ref":"creator-mode/abstract-factory/abstract-factory.md","articles":[]},{"title":"三种工厂模式比较","level":"1.4.4","depth":2,"path":"creator-mode/factory-diff.md","ref":"creator-mode/factory-diff.md","articles":[]},{"title":"建造者模式","level":"1.4.5","depth":2,"path":"creator-mode/builder/builder.md","ref":"creator-mode/builder/builder.md","articles":[]},{"title":"原型模式","level":"1.4.6","depth":2,"path":"creator-mode/prototype/prototype.md","ref":"creator-mode/prototype/prototype.md","articles":[]},{"title":"单例模式","level":"1.4.7","depth":2,"path":"creator-mode/singleton/singleton.md","ref":"creator-mode/singleton/singleton.md","articles":[]}]},"previous":{"title":"依赖关系","level":"1.2.6","depth":2,"path":"uml/dependency.md","ref":"uml/dependency.md","articles":[]},"dir":"ltr"},"config":{"plugins":[],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"language":"zh","gitbook":"*"},"file":{"path":"uml/design-principle.md","mtime":"2016-12-03T13:08:40.000Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2016-12-27T05:32:39.619Z"},"basePath":"..","book":{"language":"zh"}});
        });
    </script>
</div>

        
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="../../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

