
<!DOCTYPE HTML>
<html lang="zh" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>工厂方法模式 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="../../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../abstract-factory/abstract-factory.html" />
    
    
    <link rel="prev" href="../simple-factory/simple-factory.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="輸入並搜尋" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../../uml/introduct.html">
            
                <a href="../../uml/introduct.html">
            
                    
                    UML中类的关系
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../../uml/inherit.html">
            
                <a href="../../uml/inherit.html">
            
                    
                    继承
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="../../uml/realize.html">
            
                <a href="../../uml/realize.html">
            
                    
                    实现
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="../../uml/aggregation.html">
            
                <a href="../../uml/aggregation.html">
            
                    
                    聚合关系
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="../../uml/composition.html">
            
                <a href="../../uml/composition.html">
            
                    
                    组合关系
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="../../uml/association.html">
            
                <a href="../../uml/association.html">
            
                    
                    关联关系
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.6" data-path="../../uml/dependency.html">
            
                <a href="../../uml/dependency.html">
            
                    
                    依赖关系
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../../uml/design-principle.html">
            
                <a href="../../uml/design-principle.html">
            
                    
                    设计模式原则
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../creator-mode.html">
            
                <a href="../creator-mode.html">
            
                    
                    创建型模式
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../simple-factory/simple-factory.html">
            
                <a href="../simple-factory/simple-factory.html">
            
                    
                    简单工厂模式
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4.2" data-path="factory-method.html">
            
                <a href="factory-method.html">
            
                    
                    工厂方法模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="../abstract-factory/abstract-factory.html">
            
                <a href="../abstract-factory/abstract-factory.html">
            
                    
                    抽象工厂模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.4" data-path="../factory-diff.html">
            
                <a href="../factory-diff.html">
            
                    
                    三种工厂模式比较
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.5" data-path="../builder/builder.html">
            
                <a href="../builder/builder.html">
            
                    
                    建造者模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.6" data-path="../prototype/prototype.html">
            
                <a href="../prototype/prototype.html">
            
                    
                    原型模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.7" data-path="../singleton/singleton.html">
            
                <a href="../singleton/singleton.html">
            
                    
                    单例模式
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="../../structural-mode/structural.html">
            
                <a href="../../structural-mode/structural.html">
            
                    
                    结构型模式
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="../../structural-mode/proxy-static/proxy-static.html">
            
                <a href="../../structural-mode/proxy-static/proxy-static.html">
            
                    
                    静态代理模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="../../structural-mode/proxy-dynamic/proxy-dynamic.html">
            
                <a href="../../structural-mode/proxy-dynamic/proxy-dynamic.html">
            
                    
                    动态代理模式
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="../../behavioral-mode/behavioral.html">
            
                <a href="../../behavioral-mode/behavioral.html">
            
                    
                    行为型模式
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本書使用 GitBook 釋出
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >工厂方法模式</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#x6A21;&#x5F0F;">&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#x6A21;&#x5F0F;</h1>
<h2 id="&#x5B9A;&#x4E49;">&#x5B9A;&#x4E49;</h2>
<p>&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#x6A21;&#x5F0F;(Factory Method Pattern)&#x53C8;&#x79F0;&#x4E3A;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#xFF0C;&#x4E5F;&#x53EB;&#x865A;&#x62DF;&#x6784;&#x9020;&#x5668;(Virtual Constructor)&#x6A21;&#x5F0F;&#x6216;&#x8005;&#x591A;&#x6001;&#x5DE5;&#x5382;(Polymorphic Factory)&#x6A21;&#x5F0F;&#xFF0C;&#x5B83;&#x5C5E;&#x4E8E;&#x7C7B;&#x521B;&#x5EFA;&#x578B;&#x6A21;&#x5F0F;&#x3002;&#x5728;&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#x6A21;&#x5F0F;&#x4E2D;&#xFF0C;&#x5DE5;&#x5382;&#x7236;&#x7C7B;&#x8D1F;&#x8D23;&#x5B9A;&#x4E49;&#x521B;&#x5EFA;&#x4EA7;&#x54C1;&#x5BF9;&#x8C61;&#x7684;&#x516C;&#x5171;&#x63A5;&#x53E3;&#xFF0C;&#x800C;&#x5DE5;&#x5382;&#x5B50;&#x7C7B;&#x5219;&#x8D1F;&#x8D23;&#x751F;&#x6210;&#x5177;&#x4F53;&#x7684;&#x4EA7;&#x54C1;&#x5BF9;&#x8C61;&#xFF0C;&#x8FD9;&#x6837;&#x505A;&#x7684;&#x76EE;&#x7684;&#x662F;&#x5C06;&#x4EA7;&#x54C1;&#x7C7B;&#x7684;&#x5B9E;&#x4F8B;&#x5316;&#x64CD;&#x4F5C;&#x5EF6;&#x8FDF;&#x5230;&#x5DE5;&#x5382;&#x5B50;&#x7C7B;&#x4E2D;&#x5B8C;&#x6210;&#xFF0C;&#x5373;&#x901A;&#x8FC7;&#x5DE5;&#x5382;&#x5B50;&#x7C7B;&#x6765;&#x786E;&#x5B9A;&#x7A76;&#x7ADF;&#x5E94;&#x8BE5;&#x5B9E;&#x4F8B;&#x5316;&#x54EA;&#x4E00;&#x4E2A;&#x5177;&#x4F53;&#x4EA7;&#x54C1;&#x7C7B;&#x3002;</p>
<h2 id="&#x7C7B;&#x56FE;">&#x7C7B;&#x56FE;</h2>
<p><img src="https://rawgit.com/jasonim/design-patterns/develop/zh/creator-mode/factory-method/image/factory-method.svg" alt=""></p>
<p>&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code class="lang-java"><span class="hljs-function"><span class="hljs-keyword">public</span> <span class="hljs-keyword">static</span> <span class="hljs-keyword">void</span> <span class="hljs-title">main</span><span class="hljs-params">(String[] args)</span> </span>{
        <span class="hljs-comment">//Http</span>
        ProtocolFactory factory = <span class="hljs-keyword">new</span> HTTPFactory();
        Protocol protocol = factory.createProtocol();
        protocol.performRequest();

        <span class="hljs-comment">//UDP</span>
        factory = <span class="hljs-keyword">new</span> UDPFactory();
        protocol = factory.createProtocol();
        protocol.performRequest();

        <span class="hljs-comment">//TCP</span>
        factory = <span class="hljs-keyword">new</span> TCPFactory();
        protocol = factory.createProtocol();
        protocol.performRequest();

}
</code></pre>
<p>&#x4E0A;&#x9762;&#x7684;&#x4EE3;&#x7801;&#xFF0C; &#x5206;&#x522B;&#x901A;&#x8FC7;&#x4E0D;&#x540C;&#x7684;&#x534F;&#x8BAE;&#x5DE5;&#x5382;&#x521B;&#x5EFA;&#x4E0D;&#x540C;&#x534F;&#x8BAE;&#x7C7B;&#xFF0C; &#x65B9;&#x4FBF;&#x5BA2;&#x6237;&#x7AEF;&#x8C03;&#x7528;&#x3002;&#x8FD9;&#x6837;&#x5BA2;&#x670D;&#x7AEF;&#x4E0D;&#x9700;&#x8981;&#x5173;&#x5FC3;&#x54EA;&#x79CD;&#x5177;&#x4F53;&#x4EA7;&#x54C1;&#x7C7B;&#x5C06;&#x88AB;&#x5B9E;&#x4F8B;&#x5316;&#x8FD9;&#x4E00;&#x7EC6;&#x8282;&#xFF0C;&#x4E5F;&#x4E0D;&#x9700;&#x77E5;&#x9053;&#x5177;&#x4F53;&#x7684;&#x7C7B;&#x7684;&#x7C7B;&#x540D;&#xFF0C; &#x5F53;&#x518D;&#x6709;&#x66F4;&#x591A;&#x534F;&#x8BAE;&#x66F4;&#x65B9;&#x4FBF;&#x6269;&#x5C55;&#xFF0C;&#x4E5F;&#x9075;&#x5FAA;&#x300C;&#x5BF9;&#x6269;&#x5C55;&#x5F00;&#x653E;&#xFF0C;&#x5BF9;&#x4FEE;&#x6539;&#x5173;&#x95ED;&#x300D;&#x7684;&#x539F;&#x5219;&#x3002;&#x5982;&#x679C;&#x7EC6;&#x5FC3;&#x7684;&#x540C;&#x5B66;&#x53EF;&#x80FD;&#x4F1A;&#x53D1;&#x73B0;&#xFF0C; &#x4E09;&#x6BB5;&#x4EE3;&#x7801;&#x6709;&#x76F8;&#x540C;&#x7684;&#x5730;&#x65B9;&#xFF0C; &#x662F;&#x7684;&#xFF0C; &#x53EF;&#x4EE5;&#x8FDB;&#x4E00;&#x6B65;&#x91CD;&#x6784;&#xFF0C; &#x50CF;&#x8FD9;&#x6837;<code>createFactory(int protocol)</code>&#xFF0C;&#x8FD9;&#x91CC;&#x4E3A;&#x4E86;&#x66F4;&#x65B9;&#x4FBF;&#x5927;&#x5BB6;&#x770B;&#x61C2;&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#xFF0C;&#x5C31;&#x5206;&#x5F00;&#x6765;&#x5199;&#x4E86;&#x3002;</p>
<p>&#x8FD0;&#x884C;&#x7ED3;&#x679C;&#xFF1A;
<img src="https://rawgit.com/jasonim/design-patterns/develop/zh/creator-mode/factory-method/image/factory-method-run.png" alt=""></p>
<p><strong>&#x4F18;&#x70B9;</strong>&#xFF1A;</p>
<ul>
<li>&#x5728;&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#x6A21;&#x5F0F;&#x4E2D;&#xFF0C;&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#x7528;&#x6765;&#x521B;&#x5EFA;&#x5BA2;&#x6237;&#x6240;&#x9700;&#x8981;&#x7684;&#x4EA7;&#x54C1;&#xFF0C;&#x540C;&#x65F6;&#x8FD8;&#x5411;&#x5BA2;&#x6237;&#x9690;&#x85CF;&#x4E86;&#x54EA;&#x79CD;&#x5177;&#x4F53;&#x4EA7;&#x54C1;&#x7C7B;&#x5C06;&#x88AB;&#x5B9E;&#x4F8B;&#x5316;&#x8FD9;&#x4E00;&#x7EC6;&#x8282;&#xFF0C;&#x7528;&#x6237;&#x53EA;&#x9700;&#x8981;&#x5173;&#x5FC3;&#x6240;&#x9700;&#x4EA7;&#x54C1;&#x5BF9;&#x5E94;&#x7684;&#x5DE5;&#x5382;&#xFF0C;&#x65E0;&#x987B;&#x5173;&#x5FC3;&#x521B;&#x5EFA;&#x7EC6;&#x8282;&#xFF0C;&#x751A;&#x81F3;&#x65E0;&#x987B;&#x77E5;&#x9053;&#x5177;&#x4F53;&#x4EA7;&#x54C1;&#x7C7B;&#x7684;&#x7C7B;&#x540D;&#x3002;</li>
<li>&#x57FA;&#x4E8E;&#x5DE5;&#x5382;&#x89D2;&#x8272;&#x548C;&#x4EA7;&#x54C1;&#x89D2;&#x8272;&#x7684;&#x591A;&#x6001;&#x6027;&#x8BBE;&#x8BA1;&#x662F;&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#x6A21;&#x5F0F;&#x7684;&#x5173;&#x952E;&#x3002;&#x5B83;&#x80FD;&#x591F;&#x4F7F;&#x5DE5;&#x5382;&#x53EF;&#x4EE5;&#x81EA;&#x4E3B;&#x786E;&#x5B9A;&#x521B;&#x5EFA;&#x4F55;&#x79CD;&#x4EA7;&#x54C1;&#x5BF9;&#x8C61;&#xFF0C;&#x800C;&#x5982;&#x4F55;&#x521B;&#x5EFA;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x7EC6;&#x8282;&#x5219;&#x5B8C;&#x5168;&#x5C01;&#x88C5;&#x5728;&#x5177;&#x4F53;&#x5DE5;&#x5382;&#x5185;&#x90E8;&#x3002;&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#x6A21;&#x5F0F;&#x4E4B;&#x6240;&#x4EE5;&#x53C8;&#x88AB;&#x79F0;&#x4E3A;&#x591A;&#x6001;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x6240;&#x6709;&#x7684;&#x5177;&#x4F53;&#x5DE5;&#x5382;&#x7C7B;&#x90FD;&#x5177;&#x6709;&#x540C;&#x4E00;&#x62BD;&#x8C61;&#x7236;&#x7C7B;&#x3002;</li>
<li>&#x4F7F;&#x7528;&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#x6A21;&#x5F0F;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x4F18;&#x70B9;&#x662F;&#x5728;&#x7CFB;&#x7EDF;&#x4E2D;&#x52A0;&#x5165;&#x65B0;&#x4EA7;&#x54C1;&#x65F6;&#xFF0C;&#x65E0;&#x987B;&#x4FEE;&#x6539;&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x548C;&#x62BD;&#x8C61;&#x4EA7;&#x54C1;&#x63D0;&#x4F9B;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x65E0;&#x987B;&#x4FEE;&#x6539;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x4E5F;&#x65E0;&#x987B;&#x4FEE;&#x6539;&#x5176;&#x4ED6;&#x7684;&#x5177;&#x4F53;&#x5DE5;&#x5382;&#x548C;&#x5177;&#x4F53;&#x4EA7;&#x54C1;&#xFF0C;&#x800C;&#x53EA;&#x8981;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x5177;&#x4F53;&#x5DE5;&#x5382;&#x548C;&#x5177;&#x4F53;&#x4EA7;&#x54C1;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x7CFB;&#x7EDF;&#x7684;&#x53EF;&#x6269;&#x5C55;&#x6027;&#x4E5F;&#x5C31;&#x53D8;&#x5F97;&#x975E;&#x5E38;&#x597D;&#xFF0C;&#x5B8C;&#x5168;&#x7B26;&#x5408;&#x201C;&#x5F00;&#x95ED;&#x539F;&#x5219;&#x201D;&#x3002;</li>
</ul>
<p><strong>&#x7F3A;&#x70B9;</strong></p>
<ul>
<li>&#x5728;&#x6DFB;&#x52A0;&#x65B0;&#x4EA7;&#x54C1;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x7F16;&#x5199;&#x65B0;&#x7684;&#x5177;&#x4F53;&#x4EA7;&#x54C1;&#x7C7B;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x8981;&#x63D0;&#x4F9B;&#x4E0E;&#x4E4B;&#x5BF9;&#x5E94;&#x7684;&#x5177;&#x4F53;&#x5DE5;&#x5382;&#x7C7B;&#xFF0C;&#x7CFB;&#x7EDF;&#x4E2D;&#x7C7B;&#x7684;&#x4E2A;&#x6570;&#x5C06;&#x6210;&#x5BF9;&#x589E;&#x52A0;&#xFF0C;&#x5728;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x589E;&#x52A0;&#x4E86;&#x7CFB;&#x7EDF;&#x7684;&#x590D;&#x6742;&#x5EA6;&#xFF0C;&#x6709;&#x66F4;&#x591A;&#x7684;&#x7C7B;&#x9700;&#x8981;&#x7F16;&#x8BD1;&#x548C;&#x8FD0;&#x884C;&#xFF0C;&#x4F1A;&#x7ED9;&#x7CFB;&#x7EDF;&#x5E26;&#x6765;&#x4E00;&#x4E9B;&#x989D;&#x5916;&#x7684;&#x5F00;&#x9500;&#x3002;</li>
<li>&#x7531;&#x4E8E;&#x8003;&#x8651;&#x5230;&#x7CFB;&#x7EDF;&#x7684;&#x53EF;&#x6269;&#x5C55;&#x6027;&#xFF0C;&#x9700;&#x8981;&#x5F15;&#x5165;&#x62BD;&#x8C61;&#x5C42;&#xFF0C;&#x5728;&#x5BA2;&#x6237;&#x7AEF;&#x4EE3;&#x7801;&#x4E2D;&#x5747;&#x4F7F;&#x7528;&#x62BD;&#x8C61;&#x5C42;&#x8FDB;&#x884C;&#x5B9A;&#x4E49;&#xFF0C;&#x589E;&#x52A0;&#x4E86;&#x7CFB;&#x7EDF;&#x7684;&#x62BD;&#x8C61;&#x6027;&#x548C;&#x7406;&#x89E3;&#x96BE;&#x5EA6;&#xFF0C;&#x4E14;&#x5728;&#x5B9E;&#x73B0;&#x65F6;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x7528;&#x5230;DOM&#x3001;&#x53CD;&#x5C04;&#x7B49;&#x6280;&#x672F;&#xFF0C;&#x589E;&#x52A0;&#x4E86;&#x7CFB;&#x7EDF;&#x7684;&#x5B9E;&#x73B0;&#x96BE;&#x5EA6;&#x3002;</li>
</ul>
<h2 id="&#x4F7F;&#x7528;&#x573A;&#x666F;">&#x4F7F;&#x7528;&#x573A;&#x666F;</h2>
<p>&#x5F53;&#x6211;&#x4EEC;&#x9047;&#x89C1;&#x4E0B;&#x5217;&#x573A;&#x666F;&#xFF0C;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x5DE5;&#x4F5C;&#x65B9;&#x6CD5;&#x6A21;&#x5F0F;&#xFF1A;</p>
<ul>
<li>&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x9884;&#x5148;&#x77E5;&#x9053;&#x88AB;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x5982;&#x6211;&#x4EEC;&#x5728;&#x4E0D;&#x77E5;&#x9053;&#x53D1;&#x9001;&#x7F51;&#x7EDC;&#x8BF7;&#x6C42;&#x7528;&#x4EC0;&#x4E48;&#x534F;&#x8BAE;&#xFF08;TCP&#x3001;UPD &#x6216; HTTP&#xFF09;&#xFF0C; &#x5C31;&#x50CF;&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x3002;</li>
<li>&#x4E00;&#x4E2A;&#x7C7B;&#x60F3;&#x8981;&#x4ED6;&#x7684;&#x5B50;&#x7C7B;&#x6307;&#x5B9A;&#x5B83;&#x7684;&#x521B;&#x5EFA;&#x7684;&#x5B9E;&#x4F8B;</li>
<li>&#x5C06;&#x521B;&#x5EFA;&#x7684;&#x5BF9;&#x8C61;&#x7684;&#x4EFB;&#x52A1;&#x59D4;&#x6258;&#x7ED9;&#x591A;&#x4E2A;&#x5DE5;&#x5382;&#x5B50;&#x7C7B;&#x4E2D;&#x7684;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#xFF0C; &#x8C03;&#x7528;&#x8005;&#x5728;&#x4F7F;&#x7528;&#x65F6;&#x53EF;&#x4EE5;&#x65E0;&#x9700;&#x5173;&#x7CFB;&#x662F;&#x54EA;&#x4E2A;&#x5DE5;&#x5382;&#x5B50;&#x7C7B;&#x521B;&#x5EFA;&#x4EA7;&#x54C1;&#xFF0C; &#x9700;&#x8981;&#x65F6;&#x52A8;&#x6001;&#x6307;&#x5B9A;&#xFF0C; &#x53EF;&#x5C06;&#x5177;&#x4F53;&#x5DE5;&#x5382;&#x7C7B;&#x540D;&#x5B58;&#x50A8;&#x5728;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x6216;&#x6570;&#x636E;&#x4E2D;&#x3002;</li>
</ul>
<h2 id="android-&#x5E94;&#x7528;&#x5B9E;&#x4F8B;">Android &#x5E94;&#x7528;&#x5B9E;&#x4F8B;</h2>
<p>Android &#x4E2D;&#x7528;&#x5230;&#x4E86;&#x592A;&#x591A;&#x7684;&#x5DE5;&#x5382;&#x7C7B;&#xFF0C;&#x5176;&#x4E2D;&#x6709;&#x7528;&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#x6A21;&#x5F0F;&#x7684;&#xFF0C;&#x6BD4;&#x5982;AsyncTask&#x7C7B;&#x4E2D;&#x5DE5;&#x5382;&#x7684;&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code class="lang-java"><span class="hljs-comment">//&#x5DE5;&#x5382;&#x5B9E;&#x73B0;&#x7C7B;</span>
<span class="hljs-keyword">private</span> <span class="hljs-keyword">static</span> <span class="hljs-keyword">final</span> ThreadFactory sThreadFactory = <span class="hljs-keyword">new</span> ThreadFactory() {
    <span class="hljs-keyword">private</span> <span class="hljs-keyword">final</span> AtomicInteger mCount = <span class="hljs-keyword">new</span> AtomicInteger(<span class="hljs-number">1</span>);

    <span class="hljs-function"><span class="hljs-keyword">public</span> Thread <span class="hljs-title">newThread</span><span class="hljs-params">(Runnable r)</span> </span>{
        <span class="hljs-keyword">return</span> <span class="hljs-keyword">new</span> Thread(r, <span class="hljs-string">&quot;AsyncTask #&quot;</span> + mCount.getAndIncrement());
    }
};
</code></pre>
<p>&#x4E0A;&#x9762;&#x4EE3;&#x7801;&#x4E2D; ThreadFactory &#x5C31;&#x662F;&#x5DE5;&#x5382;&#x65B9;&#x5F0F;&#x7684;&#x7C7B;&#x7684;&#x5B9E;&#x73B0;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../simple-factory/simple-factory.html" class="navigation navigation-prev " aria-label="Previous page: 简单工厂模式">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="../abstract-factory/abstract-factory.html" class="navigation navigation-next " aria-label="Next page: 抽象工厂模式">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"工厂方法模式","level":"1.4.2","depth":2,"next":{"title":"抽象工厂模式","level":"1.4.3","depth":2,"path":"creator-mode/abstract-factory/abstract-factory.md","ref":"creator-mode/abstract-factory/abstract-factory.md","articles":[]},"previous":{"title":"简单工厂模式","level":"1.4.1","depth":2,"path":"creator-mode/simple-factory/simple-factory.md","ref":"creator-mode/simple-factory/simple-factory.md","articles":[]},"dir":"ltr"},"config":{"plugins":[],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"language":"zh","gitbook":"*"},"file":{"path":"creator-mode/factory-method/factory-method.md","mtime":"2016-12-03T13:08:40.000Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2016-12-27T05:32:39.619Z"},"basePath":"../..","book":{"language":"zh"}});
        });
    </script>
</div>

        
    <script src="../../../gitbook/gitbook.js"></script>
    <script src="../../../gitbook/theme.js"></script>
    
        
        <script src="../../../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

